zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_FLEXPWM.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2022 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K39_FLEXPWM.h
 * @version 1.7
 * @date 2022-11-18
 * @brief Peripheral Access Layer for S32K39_FLEXPWM
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K39_FLEXPWM_H_)  /* Check if memory map has not been already included */
#define S32K39_FLEXPWM_H_

#include "S32K39_COMMON.h"

/* ----------------------------------------------------------------------------
   -- FLEXPWM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLEXPWM_Peripheral_Access_Layer FLEXPWM Peripheral Access Layer
 * @{
 */

/** FLEXPWM - Size of Registers Arrays */
#define FLEXPWM_SM_COUNT                          4u
#define FLEXPWM_FAULT_COUNT                       1u

/** FLEXPWM - Register Layout Typedef */
typedef struct {
  struct {                                         /* offset: 0x0, array step: 0x60 */
    __I  uint16_t SMCNT;                             /**< Submodule Counter, array offset: 0x0, array step: 0x60 */
    __IO uint16_t SMINIT;                            /**< Submodule Initial Count, array offset: 0x2, array step: 0x60 */
    __IO uint16_t SMCTRL2;                           /**< Submodule Control 2, array offset: 0x4, array step: 0x60 */
    __IO uint16_t SMCTRL;                            /**< Submodule Control, array offset: 0x6, array step: 0x60 */
    uint8_t RESERVED_0[2];
    __IO uint16_t SMVAL0;                            /**< Submodule Value 0, array offset: 0xA, array step: 0x60 */
    __IO uint16_t SMFRACVAL1;                        /**< Submodule Fractional Value 1, array offset: 0xC, array step: 0x60 */
    __IO uint16_t SMVAL1;                            /**< Submodule Value 1, array offset: 0xE, array step: 0x60 */
    __IO uint16_t SMFRACVAL2;                        /**< Submodule Fractional Value 2, array offset: 0x10, array step: 0x60 */
    __IO uint16_t SMVAL2;                            /**< Submodule Value 2, array offset: 0x12, array step: 0x60 */
    __IO uint16_t SMFRACVAL3;                        /**< Submodule Fractional Value 3, array offset: 0x14, array step: 0x60 */
    __IO uint16_t SMVAL3;                            /**< Submodule Value 3, array offset: 0x16, array step: 0x60 */
    __IO uint16_t SMFRACVAL4;                        /**< Submodule Fractional Value 4, array offset: 0x18, array step: 0x60 */
    __IO uint16_t SMVAL4;                            /**< Submodule Value 4, array offset: 0x1A, array step: 0x60 */
    __IO uint16_t SMFRACVAL5;                        /**< Submodule Fractional Value 5, array offset: 0x1C, array step: 0x60 */
    __IO uint16_t SMVAL5;                            /**< Submodule Value 5, array offset: 0x1E, array step: 0x60 */
    __IO uint16_t SMFRCTRL;                          /**< Submodule Fractional Control, array offset: 0x20, array step: 0x60 */
    __IO uint16_t SMOCTRL;                           /**< Submodule Output Control, array offset: 0x22, array step: 0x60 */
    __IO uint16_t SMSTS;                             /**< Submodule Status, array offset: 0x24, array step: 0x60 */
    __IO uint16_t SMINTEN;                           /**< Submodule Interrupt Enable, array offset: 0x26, array step: 0x60 */
    __IO uint16_t SMDMAEN;                           /**< Submodule DMA Enable, array offset: 0x28, array step: 0x60 */
    __IO uint16_t SMTCTRL;                           /**< Submodule Output Trigger Control, array offset: 0x2A, array step: 0x60 */
    __IO uint16_t SMDISMAP0;                         /**< Submodule Fault Disable Mapping, array offset: 0x2C, array step: 0x60 */
    __IO uint16_t SMDISMAP1;                         /**< Submodule Fault Disable Mapping, array offset: 0x2E, array step: 0x60 */
    __IO uint16_t SMDTCNT0;                          /**< Submodule Deadtime Count 0, array offset: 0x30, array step: 0x60 */
    __IO uint16_t SMDTCNT1;                          /**< Submodule Deadtime Count 1, array offset: 0x32, array step: 0x60 */
    __IO uint16_t SMCAPTCTRLA;                       /**< Submodule Capture Control A, array offset: 0x34, array step: 0x60 */
    __IO uint16_t SMCAPTCOMPA;                       /**< Submodule Capture Compare A, array offset: 0x36, array step: 0x60 */
    __IO uint16_t SMCAPTCTRLB;                       /**< Submodule Capture Control B, array offset: 0x38, array step: 0x60 */
    __IO uint16_t SMCAPTCOMPB;                       /**< Submodule Capture Compare B, array offset: 0x3A, array step: 0x60 */
    __IO uint16_t SMCAPTCTRLX;                       /**< Submodule Capture Control X, array offset: 0x3C, array step: 0x60 */
    __IO uint16_t SMCAPTCOMPX;                       /**< Submodule Capture Compare X, array offset: 0x3E, array step: 0x60 */
    __I  uint16_t SMCVAL0;                           /**< Submodule Capture Value 0, array offset: 0x40, array step: 0x60 */
    __I  uint16_t SMCVAL0CYC;                        /**< Submodule Capture Value 0 Cycle, array offset: 0x42, array step: 0x60 */
    __I  uint16_t SMCVAL1;                           /**< Submodule Capture Value 1, array offset: 0x44, array step: 0x60 */
    __I  uint16_t SMCVAL1CYC;                        /**< Submodule Capture Value 1 Cycle, array offset: 0x46, array step: 0x60 */
    __I  uint16_t SMCVAL2;                           /**< Submodule Capture Value 2, array offset: 0x48, array step: 0x60 */
    __I  uint16_t SMCVAL2CYC;                        /**< Submodule Capture Value 2 Cycle, array offset: 0x4A, array step: 0x60 */
    __I  uint16_t SMCVAL3;                           /**< Submodule Capture Value 3, array offset: 0x4C, array step: 0x60 */
    __I  uint16_t SMCVAL3CYC;                        /**< Submodule Capture Value 3 Cycle, array offset: 0x4E, array step: 0x60 */
    __I  uint16_t SMCVAL4;                           /**< Submodule Capture Value 4, array offset: 0x50, array step: 0x60 */
    __I  uint16_t SMCVAL4CYC;                        /**< Submodule Capture Value 4 Cycle, array offset: 0x52, array step: 0x60 */
    __I  uint16_t SMCVAL5;                           /**< Submodule Capture Value 5, array offset: 0x54, array step: 0x60 */
    __I  uint16_t SMCVAL5CYC;                        /**< Submodule Capture Value 5 Cycle, array offset: 0x56, array step: 0x60 */
    __IO uint16_t SMPHASEDLY;                        /**< Submodule Phase Delay, array offset: 0x58, array step: 0x60 */
    uint8_t RESERVED_1[6];
  } SM[FLEXPWM_SM_COUNT];
  __IO uint16_t OUTEN;                             /**< Output Enable, offset: 0x180 */
  __IO uint16_t MASK;                              /**< Mask, offset: 0x182 */
  __IO uint16_t SWCOUT;                            /**< Software Controlled Output, offset: 0x184 */
  __IO uint16_t DTSRCSEL;                          /**< PWM Source Select, offset: 0x186 */
  __IO uint16_t MCTRL;                             /**< Master Control, offset: 0x188 */
  __IO uint16_t MCTRL2;                            /**< Master Control 2, offset: 0x18A */
  struct {                                         /* offset: 0x18C, array step: 0xA */
    __IO uint16_t FCTRL;                             /**< Fault Control, array offset: 0x18C, array step: 0xA */
    __IO uint16_t FSTS;                              /**< Fault Status, array offset: 0x18E, array step: 0xA */
    __IO uint16_t FFILT;                             /**< Fault Filter, array offset: 0x190, array step: 0xA */
    __IO uint16_t FTST;                              /**< Fault Test, array offset: 0x192, array step: 0xA */
    __IO uint16_t FCTRL2;                            /**< Fault Control 2, array offset: 0x194, array step: 0xA */
  } FAULT[FLEXPWM_FAULT_COUNT];
  uint8_t RESERVED_0[18];
  __IO uint16_t DLLCTRL;                           /**< DLL Control, offset: 0x1A8 */
  uint8_t RESERVED_1[6];
  __IO uint16_t DLLSR;                             /**< DLL Status, offset: 0x1B0 */
  uint8_t RESERVED_2[6];
  __IO uint16_t SM0BIST_CTRL;                      /**< Submodule BIST Control, offset: 0x1B8 */
  __IO uint16_t SM0BIST_CTRL1;                     /**< Submodule BIST Control, offset: 0x1BA */
  __IO uint16_t SM1BIST_CTRL;                      /**< Submodule BIST Control, offset: 0x1BC */
  __IO uint16_t SM1BIST_CTRL1;                     /**< Submodule BIST Control, offset: 0x1BE */
  __IO uint16_t SM2BIST_CTRL;                      /**< Submodule BIST Control, offset: 0x1C0 */
  __IO uint16_t SM2BIST_CTRL1;                     /**< Submodule BIST Control, offset: 0x1C2 */
  __IO uint16_t SM3BIST_CTRL;                      /**< Submodule BIST Control, offset: 0x1C4 */
  __IO uint16_t SM3BIST_CTRL1;                     /**< Submodule BIST Control, offset: 0x1C6 */
  __I  uint16_t SM0BIST_STATUS;                    /**< Submodule BIST Status, offset: 0x1C8 */
  __I  uint16_t SM0BIST_STATUS1;                   /**< Submodule BIST Status, offset: 0x1CA */
  __I  uint16_t SM1BIST_STATUS;                    /**< Submodule BIST Status, offset: 0x1CC */
  __I  uint16_t SM1BIST_STATUS1;                   /**< Submodule BIST Status, offset: 0x1CE */
  __I  uint16_t SM2BIST_STATUS;                    /**< Submodule BIST Status, offset: 0x1D0 */
  __I  uint16_t SM2BIST_STATUS1;                   /**< Submodule BIST Status, offset: 0x1D2 */
  __I  uint16_t SM3BIST_STATUS;                    /**< Submodule BIST Status, offset: 0x1D4 */
  __I  uint16_t SM3BIST_STATUS1;                   /**< Submodule BIST Status, offset: 0x1D6 */
} FLEXPWM_Type, *FLEXPWM_MemMapPtr;

