zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_FLEXPWM.h
#define FLEXPWM_SMCTRL_DBLX_MASK                 (0x2U)
#define FLEXPWM_SMCTRL_DBLX_SHIFT                (1U)
#define FLEXPWM_SMCTRL_DBLX_WIDTH                (1U)
#define FLEXPWM_SMCTRL_DBLX(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCTRL_DBLX_SHIFT)) & FLEXPWM_SMCTRL_DBLX_MASK)

#define FLEXPWM_SMCTRL_LDMOD_MASK                (0x4U)
#define FLEXPWM_SMCTRL_LDMOD_SHIFT               (2U)
#define FLEXPWM_SMCTRL_LDMOD_WIDTH               (1U)
#define FLEXPWM_SMCTRL_LDMOD(x)                  (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCTRL_LDMOD_SHIFT)) & FLEXPWM_SMCTRL_LDMOD_MASK)

#define FLEXPWM_SMCTRL_SPLIT_MASK                (0x8U)
#define FLEXPWM_SMCTRL_SPLIT_SHIFT               (3U)
#define FLEXPWM_SMCTRL_SPLIT_WIDTH               (1U)
#define FLEXPWM_SMCTRL_SPLIT(x)                  (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCTRL_SPLIT_SHIFT)) & FLEXPWM_SMCTRL_SPLIT_MASK)

#define FLEXPWM_SMCTRL_PRSC_MASK                 (0x70U)
#define FLEXPWM_SMCTRL_PRSC_SHIFT                (4U)
#define FLEXPWM_SMCTRL_PRSC_WIDTH                (3U)
#define FLEXPWM_SMCTRL_PRSC(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCTRL_PRSC_SHIFT)) & FLEXPWM_SMCTRL_PRSC_MASK)

#define FLEXPWM_SMCTRL_COMPMODE_MASK             (0x80U)
#define FLEXPWM_SMCTRL_COMPMODE_SHIFT            (7U)
#define FLEXPWM_SMCTRL_COMPMODE_WIDTH            (1U)
#define FLEXPWM_SMCTRL_COMPMODE(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCTRL_COMPMODE_SHIFT)) & FLEXPWM_SMCTRL_COMPMODE_MASK)

#define FLEXPWM_SMCTRL_DT_MASK                   (0x300U)
#define FLEXPWM_SMCTRL_DT_SHIFT                  (8U)
#define FLEXPWM_SMCTRL_DT_WIDTH                  (2U)
#define FLEXPWM_SMCTRL_DT(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCTRL_DT_SHIFT)) & FLEXPWM_SMCTRL_DT_MASK)

#define FLEXPWM_SMCTRL_FULL_MASK                 (0x400U)
#define FLEXPWM_SMCTRL_FULL_SHIFT                (10U)
#define FLEXPWM_SMCTRL_FULL_WIDTH                (1U)
#define FLEXPWM_SMCTRL_FULL(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCTRL_FULL_SHIFT)) & FLEXPWM_SMCTRL_FULL_MASK)

#define FLEXPWM_SMCTRL_HALF_MASK                 (0x800U)
#define FLEXPWM_SMCTRL_HALF_SHIFT                (11U)
#define FLEXPWM_SMCTRL_HALF_WIDTH                (1U)
#define FLEXPWM_SMCTRL_HALF(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCTRL_HALF_SHIFT)) & FLEXPWM_SMCTRL_HALF_MASK)

#define FLEXPWM_SMCTRL_LDFQ_MASK                 (0xF000U)
#define FLEXPWM_SMCTRL_LDFQ_SHIFT                (12U)
#define FLEXPWM_SMCTRL_LDFQ_WIDTH                (4U)
#define FLEXPWM_SMCTRL_LDFQ(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCTRL_LDFQ_SHIFT)) & FLEXPWM_SMCTRL_LDFQ_MASK)
/*! @} */

/*! @name SMVAL0 - Submodule Value 0 */
/*! @{ */

#define FLEXPWM_SMVAL0_VAL0_MASK                 (0xFFFFU)
#define FLEXPWM_SMVAL0_VAL0_SHIFT                (0U)
#define FLEXPWM_SMVAL0_VAL0_WIDTH                (16U)
#define FLEXPWM_SMVAL0_VAL0(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMVAL0_VAL0_SHIFT)) & FLEXPWM_SMVAL0_VAL0_MASK)
/*! @} */

/*! @name SMFRACVAL1 - Submodule Fractional Value 1 */
/*! @{ */

#define FLEXPWM_SMFRACVAL1_FRACVAL1_MASK         (0xF800U)
#define FLEXPWM_SMFRACVAL1_FRACVAL1_SHIFT        (11U)
#define FLEXPWM_SMFRACVAL1_FRACVAL1_WIDTH        (5U)
#define FLEXPWM_SMFRACVAL1_FRACVAL1(x)           (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMFRACVAL1_FRACVAL1_SHIFT)) & FLEXPWM_SMFRACVAL1_FRACVAL1_MASK)
/*! @} */

/*! @name SMVAL1 - Submodule Value 1 */
/*! @{ */

#define FLEXPWM_SMVAL1_VAL1_MASK                 (0xFFFFU)
#define FLEXPWM_SMVAL1_VAL1_SHIFT                (0U)
#define FLEXPWM_SMVAL1_VAL1_WIDTH                (16U)
#define FLEXPWM_SMVAL1_VAL1(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMVAL1_VAL1_SHIFT)) & FLEXPWM_SMVAL1_VAL1_MASK)
/*! @} */

/*! @name SMFRACVAL2 - Submodule Fractional Value 2 */
/*! @{ */

#define FLEXPWM_SMFRACVAL2_FRACVAL2_MASK         (0xF800U)
#define FLEXPWM_SMFRACVAL2_FRACVAL2_SHIFT        (11U)
#define FLEXPWM_SMFRACVAL2_FRACVAL2_WIDTH        (5U)
#define FLEXPWM_SMFRACVAL2_FRACVAL2(x)           (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMFRACVAL2_FRACVAL2_SHIFT)) & FLEXPWM_SMFRACVAL2_FRACVAL2_MASK)
/*! @} */

/*! @name SMVAL2 - Submodule Value 2 */
/*! @{ */

#define FLEXPWM_SMVAL2_VAL2_MASK                 (0xFFFFU)
#define FLEXPWM_SMVAL2_VAL2_SHIFT                (0U)
#define FLEXPWM_SMVAL2_VAL2_WIDTH                (16U)
#define FLEXPWM_SMVAL2_VAL2(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMVAL2_VAL2_SHIFT)) & FLEXPWM_SMVAL2_VAL2_MASK)
/*! @} */

/*! @name SMFRACVAL3 - Submodule Fractional Value 3 */
/*! @{ */

#define FLEXPWM_SMFRACVAL3_FRACVAL3_MASK         (0xF800U)
#define FLEXPWM_SMFRACVAL3_FRACVAL3_SHIFT        (11U)
#define FLEXPWM_SMFRACVAL3_FRACVAL3_WIDTH        (5U)
#define FLEXPWM_SMFRACVAL3_FRACVAL3(x)           (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMFRACVAL3_FRACVAL3_SHIFT)) & FLEXPWM_SMFRACVAL3_FRACVAL3_MASK)
/*! @} */

/*! @name SMVAL3 - Submodule Value 3 */
/*! @{ */

#define FLEXPWM_SMVAL3_VAL3_MASK                 (0xFFFFU)
#define FLEXPWM_SMVAL3_VAL3_SHIFT                (0U)
#define FLEXPWM_SMVAL3_VAL3_WIDTH                (16U)
#define FLEXPWM_SMVAL3_VAL3(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMVAL3_VAL3_SHIFT)) & FLEXPWM_SMVAL3_VAL3_MASK)
/*! @} */

/*! @name SMFRACVAL4 - Submodule Fractional Value 4 */
/*! @{ */

#define FLEXPWM_SMFRACVAL4_FRACVAL4_MASK         (0xF800U)
#define FLEXPWM_SMFRACVAL4_FRACVAL4_SHIFT        (11U)
#define FLEXPWM_SMFRACVAL4_FRACVAL4_WIDTH        (5U)
#define FLEXPWM_SMFRACVAL4_FRACVAL4(x)           (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMFRACVAL4_FRACVAL4_SHIFT)) & FLEXPWM_SMFRACVAL4_FRACVAL4_MASK)
/*! @} */

/*! @name SMVAL4 - Submodule Value 4 */
/*! @{ */

#define FLEXPWM_SMVAL4_VAL4_MASK                 (0xFFFFU)
#define FLEXPWM_SMVAL4_VAL4_SHIFT                (0U)
#define FLEXPWM_SMVAL4_VAL4_WIDTH                (16U)
#define FLEXPWM_SMVAL4_VAL4(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMVAL4_VAL4_SHIFT)) & FLEXPWM_SMVAL4_VAL4_MASK)
/*! @} */

/*! @name SMFRACVAL5 - Submodule Fractional Value 5 */
/*! @{ */

#define FLEXPWM_SMFRACVAL5_FRACVAL5_MASK         (0xF800U)
#define FLEXPWM_SMFRACVAL5_FRACVAL5_SHIFT        (11U)
#define FLEXPWM_SMFRACVAL5_FRACVAL5_WIDTH        (5U)
#define FLEXPWM_SMFRACVAL5_FRACVAL5(x)           (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMFRACVAL5_FRACVAL5_SHIFT)) & FLEXPWM_SMFRACVAL5_FRACVAL5_MASK)
/*! @} */

