zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_FLEXPWM.h
/*! @name SMVAL5 - Submodule Value 5 */
/*! @{ */

#define FLEXPWM_SMVAL5_VAL5_MASK                 (0xFFFFU)
#define FLEXPWM_SMVAL5_VAL5_SHIFT                (0U)
#define FLEXPWM_SMVAL5_VAL5_WIDTH                (16U)
#define FLEXPWM_SMVAL5_VAL5(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMVAL5_VAL5_SHIFT)) & FLEXPWM_SMVAL5_VAL5_MASK)
/*! @} */

/*! @name SMFRCTRL - Submodule Fractional Control */
/*! @{ */

#define FLEXPWM_SMFRCTRL_FRAC1_EN_MASK           (0x2U)
#define FLEXPWM_SMFRCTRL_FRAC1_EN_SHIFT          (1U)
#define FLEXPWM_SMFRCTRL_FRAC1_EN_WIDTH          (1U)
#define FLEXPWM_SMFRCTRL_FRAC1_EN(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMFRCTRL_FRAC1_EN_SHIFT)) & FLEXPWM_SMFRCTRL_FRAC1_EN_MASK)

#define FLEXPWM_SMFRCTRL_FRAC23_EN_MASK          (0x4U)
#define FLEXPWM_SMFRCTRL_FRAC23_EN_SHIFT         (2U)
#define FLEXPWM_SMFRCTRL_FRAC23_EN_WIDTH         (1U)
#define FLEXPWM_SMFRCTRL_FRAC23_EN(x)            (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMFRCTRL_FRAC23_EN_SHIFT)) & FLEXPWM_SMFRCTRL_FRAC23_EN_MASK)

#define FLEXPWM_SMFRCTRL_FRAC45_EN_MASK          (0x10U)
#define FLEXPWM_SMFRCTRL_FRAC45_EN_SHIFT         (4U)
#define FLEXPWM_SMFRCTRL_FRAC45_EN_WIDTH         (1U)
#define FLEXPWM_SMFRCTRL_FRAC45_EN(x)            (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMFRCTRL_FRAC45_EN_SHIFT)) & FLEXPWM_SMFRCTRL_FRAC45_EN_MASK)

#define FLEXPWM_SMFRCTRL_FRAC_PU_MASK            (0x100U)
#define FLEXPWM_SMFRCTRL_FRAC_PU_SHIFT           (8U)
#define FLEXPWM_SMFRCTRL_FRAC_PU_WIDTH           (1U)
#define FLEXPWM_SMFRCTRL_FRAC_PU(x)              (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMFRCTRL_FRAC_PU_SHIFT)) & FLEXPWM_SMFRCTRL_FRAC_PU_MASK)
/*! @} */

/*! @name SMOCTRL - Submodule Output Control */
/*! @{ */

#define FLEXPWM_SMOCTRL_PWMXFS_MASK              (0x3U)
#define FLEXPWM_SMOCTRL_PWMXFS_SHIFT             (0U)
#define FLEXPWM_SMOCTRL_PWMXFS_WIDTH             (2U)
#define FLEXPWM_SMOCTRL_PWMXFS(x)                (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMOCTRL_PWMXFS_SHIFT)) & FLEXPWM_SMOCTRL_PWMXFS_MASK)

#define FLEXPWM_SMOCTRL_PWMBFS_MASK              (0xCU)
#define FLEXPWM_SMOCTRL_PWMBFS_SHIFT             (2U)
#define FLEXPWM_SMOCTRL_PWMBFS_WIDTH             (2U)
#define FLEXPWM_SMOCTRL_PWMBFS(x)                (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMOCTRL_PWMBFS_SHIFT)) & FLEXPWM_SMOCTRL_PWMBFS_MASK)

#define FLEXPWM_SMOCTRL_PWMAFS_MASK              (0x30U)
#define FLEXPWM_SMOCTRL_PWMAFS_SHIFT             (4U)
#define FLEXPWM_SMOCTRL_PWMAFS_WIDTH             (2U)
#define FLEXPWM_SMOCTRL_PWMAFS(x)                (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMOCTRL_PWMAFS_SHIFT)) & FLEXPWM_SMOCTRL_PWMAFS_MASK)

#define FLEXPWM_SMOCTRL_POLX_MASK                (0x100U)
#define FLEXPWM_SMOCTRL_POLX_SHIFT               (8U)
#define FLEXPWM_SMOCTRL_POLX_WIDTH               (1U)
#define FLEXPWM_SMOCTRL_POLX(x)                  (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMOCTRL_POLX_SHIFT)) & FLEXPWM_SMOCTRL_POLX_MASK)

#define FLEXPWM_SMOCTRL_POLB_MASK                (0x200U)
#define FLEXPWM_SMOCTRL_POLB_SHIFT               (9U)
#define FLEXPWM_SMOCTRL_POLB_WIDTH               (1U)
#define FLEXPWM_SMOCTRL_POLB(x)                  (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMOCTRL_POLB_SHIFT)) & FLEXPWM_SMOCTRL_POLB_MASK)

#define FLEXPWM_SMOCTRL_POLA_MASK                (0x400U)
#define FLEXPWM_SMOCTRL_POLA_SHIFT               (10U)
#define FLEXPWM_SMOCTRL_POLA_WIDTH               (1U)
#define FLEXPWM_SMOCTRL_POLA(x)                  (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMOCTRL_POLA_SHIFT)) & FLEXPWM_SMOCTRL_POLA_MASK)

#define FLEXPWM_SMOCTRL_PWMX_IN_MASK             (0x2000U)
#define FLEXPWM_SMOCTRL_PWMX_IN_SHIFT            (13U)
#define FLEXPWM_SMOCTRL_PWMX_IN_WIDTH            (1U)
#define FLEXPWM_SMOCTRL_PWMX_IN(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMOCTRL_PWMX_IN_SHIFT)) & FLEXPWM_SMOCTRL_PWMX_IN_MASK)

#define FLEXPWM_SMOCTRL_PWMB_IN_MASK             (0x4000U)
#define FLEXPWM_SMOCTRL_PWMB_IN_SHIFT            (14U)
#define FLEXPWM_SMOCTRL_PWMB_IN_WIDTH            (1U)
#define FLEXPWM_SMOCTRL_PWMB_IN(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMOCTRL_PWMB_IN_SHIFT)) & FLEXPWM_SMOCTRL_PWMB_IN_MASK)

#define FLEXPWM_SMOCTRL_PWMA_IN_MASK             (0x8000U)
#define FLEXPWM_SMOCTRL_PWMA_IN_SHIFT            (15U)
#define FLEXPWM_SMOCTRL_PWMA_IN_WIDTH            (1U)
#define FLEXPWM_SMOCTRL_PWMA_IN(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMOCTRL_PWMA_IN_SHIFT)) & FLEXPWM_SMOCTRL_PWMA_IN_MASK)
/*! @} */

/*! @name SMSTS - Submodule Status */
/*! @{ */

#define FLEXPWM_SMSTS_CMPF_MASK                  (0x3FU)
#define FLEXPWM_SMSTS_CMPF_SHIFT                 (0U)
#define FLEXPWM_SMSTS_CMPF_WIDTH                 (6U)
#define FLEXPWM_SMSTS_CMPF(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMSTS_CMPF_SHIFT)) & FLEXPWM_SMSTS_CMPF_MASK)

#define FLEXPWM_SMSTS_CFX0_MASK                  (0x40U)
#define FLEXPWM_SMSTS_CFX0_SHIFT                 (6U)
#define FLEXPWM_SMSTS_CFX0_WIDTH                 (1U)
#define FLEXPWM_SMSTS_CFX0(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMSTS_CFX0_SHIFT)) & FLEXPWM_SMSTS_CFX0_MASK)

#define FLEXPWM_SMSTS_CFX1_MASK                  (0x80U)
#define FLEXPWM_SMSTS_CFX1_SHIFT                 (7U)
#define FLEXPWM_SMSTS_CFX1_WIDTH                 (1U)
#define FLEXPWM_SMSTS_CFX1(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMSTS_CFX1_SHIFT)) & FLEXPWM_SMSTS_CFX1_MASK)

#define FLEXPWM_SMSTS_CFB0_MASK                  (0x100U)
#define FLEXPWM_SMSTS_CFB0_SHIFT                 (8U)
#define FLEXPWM_SMSTS_CFB0_WIDTH                 (1U)
#define FLEXPWM_SMSTS_CFB0(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMSTS_CFB0_SHIFT)) & FLEXPWM_SMSTS_CFB0_MASK)

#define FLEXPWM_SMSTS_CFB1_MASK                  (0x200U)
#define FLEXPWM_SMSTS_CFB1_SHIFT                 (9U)
#define FLEXPWM_SMSTS_CFB1_WIDTH                 (1U)
#define FLEXPWM_SMSTS_CFB1(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMSTS_CFB1_SHIFT)) & FLEXPWM_SMSTS_CFB1_MASK)

