zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_FLEXPWM.h
#define FLEXPWM_SMSTS_CFA0_MASK                  (0x400U)
#define FLEXPWM_SMSTS_CFA0_SHIFT                 (10U)
#define FLEXPWM_SMSTS_CFA0_WIDTH                 (1U)
#define FLEXPWM_SMSTS_CFA0(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMSTS_CFA0_SHIFT)) & FLEXPWM_SMSTS_CFA0_MASK)

#define FLEXPWM_SMSTS_CFA1_MASK                  (0x800U)
#define FLEXPWM_SMSTS_CFA1_SHIFT                 (11U)
#define FLEXPWM_SMSTS_CFA1_WIDTH                 (1U)
#define FLEXPWM_SMSTS_CFA1(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMSTS_CFA1_SHIFT)) & FLEXPWM_SMSTS_CFA1_MASK)

#define FLEXPWM_SMSTS_RF_MASK                    (0x1000U)
#define FLEXPWM_SMSTS_RF_SHIFT                   (12U)
#define FLEXPWM_SMSTS_RF_WIDTH                   (1U)
#define FLEXPWM_SMSTS_RF(x)                      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMSTS_RF_SHIFT)) & FLEXPWM_SMSTS_RF_MASK)

#define FLEXPWM_SMSTS_REF_MASK                   (0x2000U)
#define FLEXPWM_SMSTS_REF_SHIFT                  (13U)
#define FLEXPWM_SMSTS_REF_WIDTH                  (1U)
#define FLEXPWM_SMSTS_REF(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMSTS_REF_SHIFT)) & FLEXPWM_SMSTS_REF_MASK)

#define FLEXPWM_SMSTS_RUF_MASK                   (0x4000U)
#define FLEXPWM_SMSTS_RUF_SHIFT                  (14U)
#define FLEXPWM_SMSTS_RUF_WIDTH                  (1U)
#define FLEXPWM_SMSTS_RUF(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMSTS_RUF_SHIFT)) & FLEXPWM_SMSTS_RUF_MASK)
/*! @} */

/*! @name SMINTEN - Submodule Interrupt Enable */
/*! @{ */

#define FLEXPWM_SMINTEN_CMPIE_MASK               (0x3FU)
#define FLEXPWM_SMINTEN_CMPIE_SHIFT              (0U)
#define FLEXPWM_SMINTEN_CMPIE_WIDTH              (6U)
#define FLEXPWM_SMINTEN_CMPIE(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMINTEN_CMPIE_SHIFT)) & FLEXPWM_SMINTEN_CMPIE_MASK)

#define FLEXPWM_SMINTEN_CX0IE_MASK               (0x40U)
#define FLEXPWM_SMINTEN_CX0IE_SHIFT              (6U)
#define FLEXPWM_SMINTEN_CX0IE_WIDTH              (1U)
#define FLEXPWM_SMINTEN_CX0IE(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMINTEN_CX0IE_SHIFT)) & FLEXPWM_SMINTEN_CX0IE_MASK)

#define FLEXPWM_SMINTEN_CX1IE_MASK               (0x80U)
#define FLEXPWM_SMINTEN_CX1IE_SHIFT              (7U)
#define FLEXPWM_SMINTEN_CX1IE_WIDTH              (1U)
#define FLEXPWM_SMINTEN_CX1IE(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMINTEN_CX1IE_SHIFT)) & FLEXPWM_SMINTEN_CX1IE_MASK)

#define FLEXPWM_SMINTEN_CB0IE_MASK               (0x100U)
#define FLEXPWM_SMINTEN_CB0IE_SHIFT              (8U)
#define FLEXPWM_SMINTEN_CB0IE_WIDTH              (1U)
#define FLEXPWM_SMINTEN_CB0IE(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMINTEN_CB0IE_SHIFT)) & FLEXPWM_SMINTEN_CB0IE_MASK)

#define FLEXPWM_SMINTEN_CB1IE_MASK               (0x200U)
#define FLEXPWM_SMINTEN_CB1IE_SHIFT              (9U)
#define FLEXPWM_SMINTEN_CB1IE_WIDTH              (1U)
#define FLEXPWM_SMINTEN_CB1IE(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMINTEN_CB1IE_SHIFT)) & FLEXPWM_SMINTEN_CB1IE_MASK)

#define FLEXPWM_SMINTEN_CA0IE_MASK               (0x400U)
#define FLEXPWM_SMINTEN_CA0IE_SHIFT              (10U)
#define FLEXPWM_SMINTEN_CA0IE_WIDTH              (1U)
#define FLEXPWM_SMINTEN_CA0IE(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMINTEN_CA0IE_SHIFT)) & FLEXPWM_SMINTEN_CA0IE_MASK)

#define FLEXPWM_SMINTEN_CA1IE_MASK               (0x800U)
#define FLEXPWM_SMINTEN_CA1IE_SHIFT              (11U)
#define FLEXPWM_SMINTEN_CA1IE_WIDTH              (1U)
#define FLEXPWM_SMINTEN_CA1IE(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMINTEN_CA1IE_SHIFT)) & FLEXPWM_SMINTEN_CA1IE_MASK)

#define FLEXPWM_SMINTEN_RIE_MASK                 (0x1000U)
#define FLEXPWM_SMINTEN_RIE_SHIFT                (12U)
#define FLEXPWM_SMINTEN_RIE_WIDTH                (1U)
#define FLEXPWM_SMINTEN_RIE(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMINTEN_RIE_SHIFT)) & FLEXPWM_SMINTEN_RIE_MASK)

#define FLEXPWM_SMINTEN_REIE_MASK                (0x2000U)
#define FLEXPWM_SMINTEN_REIE_SHIFT               (13U)
#define FLEXPWM_SMINTEN_REIE_WIDTH               (1U)
#define FLEXPWM_SMINTEN_REIE(x)                  (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMINTEN_REIE_SHIFT)) & FLEXPWM_SMINTEN_REIE_MASK)
/*! @} */

/*! @name SMDMAEN - Submodule DMA Enable */
/*! @{ */

#define FLEXPWM_SMDMAEN_CX0DE_MASK               (0x1U)
#define FLEXPWM_SMDMAEN_CX0DE_SHIFT              (0U)
#define FLEXPWM_SMDMAEN_CX0DE_WIDTH              (1U)
#define FLEXPWM_SMDMAEN_CX0DE(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMDMAEN_CX0DE_SHIFT)) & FLEXPWM_SMDMAEN_CX0DE_MASK)

#define FLEXPWM_SMDMAEN_CX1DE_MASK               (0x2U)
#define FLEXPWM_SMDMAEN_CX1DE_SHIFT              (1U)
#define FLEXPWM_SMDMAEN_CX1DE_WIDTH              (1U)
#define FLEXPWM_SMDMAEN_CX1DE(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMDMAEN_CX1DE_SHIFT)) & FLEXPWM_SMDMAEN_CX1DE_MASK)

#define FLEXPWM_SMDMAEN_CB0DE_MASK               (0x4U)
#define FLEXPWM_SMDMAEN_CB0DE_SHIFT              (2U)
#define FLEXPWM_SMDMAEN_CB0DE_WIDTH              (1U)
#define FLEXPWM_SMDMAEN_CB0DE(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMDMAEN_CB0DE_SHIFT)) & FLEXPWM_SMDMAEN_CB0DE_MASK)

#define FLEXPWM_SMDMAEN_CB1DE_MASK               (0x8U)
#define FLEXPWM_SMDMAEN_CB1DE_SHIFT              (3U)
#define FLEXPWM_SMDMAEN_CB1DE_WIDTH              (1U)
#define FLEXPWM_SMDMAEN_CB1DE(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMDMAEN_CB1DE_SHIFT)) & FLEXPWM_SMDMAEN_CB1DE_MASK)

#define FLEXPWM_SMDMAEN_CA0DE_MASK               (0x10U)
#define FLEXPWM_SMDMAEN_CA0DE_SHIFT              (4U)
#define FLEXPWM_SMDMAEN_CA0DE_WIDTH              (1U)
#define FLEXPWM_SMDMAEN_CA0DE(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMDMAEN_CA0DE_SHIFT)) & FLEXPWM_SMDMAEN_CA0DE_MASK)

#define FLEXPWM_SMDMAEN_CA1DE_MASK               (0x20U)
#define FLEXPWM_SMDMAEN_CA1DE_SHIFT              (5U)
#define FLEXPWM_SMDMAEN_CA1DE_WIDTH              (1U)
#define FLEXPWM_SMDMAEN_CA1DE(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMDMAEN_CA1DE_SHIFT)) & FLEXPWM_SMDMAEN_CA1DE_MASK)

#define FLEXPWM_SMDMAEN_CAPTDE_MASK              (0xC0U)
#define FLEXPWM_SMDMAEN_CAPTDE_SHIFT             (6U)
#define FLEXPWM_SMDMAEN_CAPTDE_WIDTH             (2U)
#define FLEXPWM_SMDMAEN_CAPTDE(x)                (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMDMAEN_CAPTDE_SHIFT)) & FLEXPWM_SMDMAEN_CAPTDE_MASK)

#define FLEXPWM_SMDMAEN_FAND_MASK                (0x100U)
#define FLEXPWM_SMDMAEN_FAND_SHIFT               (8U)
#define FLEXPWM_SMDMAEN_FAND_WIDTH               (1U)
#define FLEXPWM_SMDMAEN_FAND(x)                  (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMDMAEN_FAND_SHIFT)) & FLEXPWM_SMDMAEN_FAND_MASK)

#define FLEXPWM_SMDMAEN_VALDE_MASK               (0x200U)
#define FLEXPWM_SMDMAEN_VALDE_SHIFT              (9U)
#define FLEXPWM_SMDMAEN_VALDE_WIDTH              (1U)
#define FLEXPWM_SMDMAEN_VALDE(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMDMAEN_VALDE_SHIFT)) & FLEXPWM_SMDMAEN_VALDE_MASK)
/*! @} */

/*! @name SMTCTRL - Submodule Output Trigger Control */
/*! @{ */

#define FLEXPWM_SMTCTRL_OUT_TRIG_EN_MASK         (0x3FU)
#define FLEXPWM_SMTCTRL_OUT_TRIG_EN_SHIFT        (0U)
#define FLEXPWM_SMTCTRL_OUT_TRIG_EN_WIDTH        (6U)
#define FLEXPWM_SMTCTRL_OUT_TRIG_EN(x)           (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMTCTRL_OUT_TRIG_EN_SHIFT)) & FLEXPWM_SMTCTRL_OUT_TRIG_EN_MASK)

#define FLEXPWM_SMTCTRL_TRGFRQ_MASK              (0x1000U)
#define FLEXPWM_SMTCTRL_TRGFRQ_SHIFT             (12U)
#define FLEXPWM_SMTCTRL_TRGFRQ_WIDTH             (1U)
#define FLEXPWM_SMTCTRL_TRGFRQ(x)                (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMTCTRL_TRGFRQ_SHIFT)) & FLEXPWM_SMTCTRL_TRGFRQ_MASK)

#define FLEXPWM_SMTCTRL_PWBOT1_MASK              (0x4000U)
#define FLEXPWM_SMTCTRL_PWBOT1_SHIFT             (14U)
#define FLEXPWM_SMTCTRL_PWBOT1_WIDTH             (1U)
#define FLEXPWM_SMTCTRL_PWBOT1(x)                (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMTCTRL_PWBOT1_SHIFT)) & FLEXPWM_SMTCTRL_PWBOT1_MASK)

#define FLEXPWM_SMTCTRL_PWAOT0_MASK              (0x8000U)
#define FLEXPWM_SMTCTRL_PWAOT0_SHIFT             (15U)
#define FLEXPWM_SMTCTRL_PWAOT0_WIDTH             (1U)
#define FLEXPWM_SMTCTRL_PWAOT0(x)                (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMTCTRL_PWAOT0_SHIFT)) & FLEXPWM_SMTCTRL_PWAOT0_MASK)
/*! @} */

