zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_FLEXPWM.h
/*! @name SMDISMAP0 - Submodule Fault Disable Mapping */
/*! @{ */

#define FLEXPWM_SMDISMAP0_DIS0A_MASK             (0xFU)
#define FLEXPWM_SMDISMAP0_DIS0A_SHIFT            (0U)
#define FLEXPWM_SMDISMAP0_DIS0A_WIDTH            (4U)
#define FLEXPWM_SMDISMAP0_DIS0A(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMDISMAP0_DIS0A_SHIFT)) & FLEXPWM_SMDISMAP0_DIS0A_MASK)

#define FLEXPWM_SMDISMAP0_DIS0B_MASK             (0xF0U)
#define FLEXPWM_SMDISMAP0_DIS0B_SHIFT            (4U)
#define FLEXPWM_SMDISMAP0_DIS0B_WIDTH            (4U)
#define FLEXPWM_SMDISMAP0_DIS0B(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMDISMAP0_DIS0B_SHIFT)) & FLEXPWM_SMDISMAP0_DIS0B_MASK)

#define FLEXPWM_SMDISMAP0_DIS0X_MASK             (0xF00U)
#define FLEXPWM_SMDISMAP0_DIS0X_SHIFT            (8U)
#define FLEXPWM_SMDISMAP0_DIS0X_WIDTH            (4U)
#define FLEXPWM_SMDISMAP0_DIS0X(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMDISMAP0_DIS0X_SHIFT)) & FLEXPWM_SMDISMAP0_DIS0X_MASK)
/*! @} */

/*! @name SMDISMAP1 - Submodule Fault Disable Mapping */
/*! @{ */

#define FLEXPWM_SMDISMAP1_DIS1A_MASK             (0xFU)
#define FLEXPWM_SMDISMAP1_DIS1A_SHIFT            (0U)
#define FLEXPWM_SMDISMAP1_DIS1A_WIDTH            (4U)
#define FLEXPWM_SMDISMAP1_DIS1A(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMDISMAP1_DIS1A_SHIFT)) & FLEXPWM_SMDISMAP1_DIS1A_MASK)

#define FLEXPWM_SMDISMAP1_DIS1B_MASK             (0xF0U)
#define FLEXPWM_SMDISMAP1_DIS1B_SHIFT            (4U)
#define FLEXPWM_SMDISMAP1_DIS1B_WIDTH            (4U)
#define FLEXPWM_SMDISMAP1_DIS1B(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMDISMAP1_DIS1B_SHIFT)) & FLEXPWM_SMDISMAP1_DIS1B_MASK)

#define FLEXPWM_SMDISMAP1_DIS1X_MASK             (0xF00U)
#define FLEXPWM_SMDISMAP1_DIS1X_SHIFT            (8U)
#define FLEXPWM_SMDISMAP1_DIS1X_WIDTH            (4U)
#define FLEXPWM_SMDISMAP1_DIS1X(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMDISMAP1_DIS1X_SHIFT)) & FLEXPWM_SMDISMAP1_DIS1X_MASK)
/*! @} */

/*! @name SMDTCNT0 - Submodule Deadtime Count 0 */
/*! @{ */

#define FLEXPWM_SMDTCNT0_DTCNT0_MASK             (0xFFFFU)
#define FLEXPWM_SMDTCNT0_DTCNT0_SHIFT            (0U)
#define FLEXPWM_SMDTCNT0_DTCNT0_WIDTH            (16U)
#define FLEXPWM_SMDTCNT0_DTCNT0(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMDTCNT0_DTCNT0_SHIFT)) & FLEXPWM_SMDTCNT0_DTCNT0_MASK)
/*! @} */

/*! @name SMDTCNT1 - Submodule Deadtime Count 1 */
/*! @{ */

#define FLEXPWM_SMDTCNT1_DTCNT1_MASK             (0xFFFFU)
#define FLEXPWM_SMDTCNT1_DTCNT1_SHIFT            (0U)
#define FLEXPWM_SMDTCNT1_DTCNT1_WIDTH            (16U)
#define FLEXPWM_SMDTCNT1_DTCNT1(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMDTCNT1_DTCNT1_SHIFT)) & FLEXPWM_SMDTCNT1_DTCNT1_MASK)
/*! @} */

/*! @name SMCAPTCTRLA - Submodule Capture Control A */
/*! @{ */

#define FLEXPWM_SMCAPTCTRLA_ARMA_MASK            (0x1U)
#define FLEXPWM_SMCAPTCTRLA_ARMA_SHIFT           (0U)
#define FLEXPWM_SMCAPTCTRLA_ARMA_WIDTH           (1U)
#define FLEXPWM_SMCAPTCTRLA_ARMA(x)              (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLA_ARMA_SHIFT)) & FLEXPWM_SMCAPTCTRLA_ARMA_MASK)

#define FLEXPWM_SMCAPTCTRLA_ONESHOTA_MASK        (0x2U)
#define FLEXPWM_SMCAPTCTRLA_ONESHOTA_SHIFT       (1U)
#define FLEXPWM_SMCAPTCTRLA_ONESHOTA_WIDTH       (1U)
#define FLEXPWM_SMCAPTCTRLA_ONESHOTA(x)          (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLA_ONESHOTA_SHIFT)) & FLEXPWM_SMCAPTCTRLA_ONESHOTA_MASK)

#define FLEXPWM_SMCAPTCTRLA_EDGA0_MASK           (0xCU)
#define FLEXPWM_SMCAPTCTRLA_EDGA0_SHIFT          (2U)
#define FLEXPWM_SMCAPTCTRLA_EDGA0_WIDTH          (2U)
#define FLEXPWM_SMCAPTCTRLA_EDGA0(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLA_EDGA0_SHIFT)) & FLEXPWM_SMCAPTCTRLA_EDGA0_MASK)

#define FLEXPWM_SMCAPTCTRLA_EDGA1_MASK           (0x30U)
#define FLEXPWM_SMCAPTCTRLA_EDGA1_SHIFT          (4U)
#define FLEXPWM_SMCAPTCTRLA_EDGA1_WIDTH          (2U)
#define FLEXPWM_SMCAPTCTRLA_EDGA1(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLA_EDGA1_SHIFT)) & FLEXPWM_SMCAPTCTRLA_EDGA1_MASK)

#define FLEXPWM_SMCAPTCTRLA_INP_SELA_MASK        (0x40U)
#define FLEXPWM_SMCAPTCTRLA_INP_SELA_SHIFT       (6U)
#define FLEXPWM_SMCAPTCTRLA_INP_SELA_WIDTH       (1U)
#define FLEXPWM_SMCAPTCTRLA_INP_SELA(x)          (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLA_INP_SELA_SHIFT)) & FLEXPWM_SMCAPTCTRLA_INP_SELA_MASK)

#define FLEXPWM_SMCAPTCTRLA_EDGCNTA_EN_MASK      (0x80U)
#define FLEXPWM_SMCAPTCTRLA_EDGCNTA_EN_SHIFT     (7U)
#define FLEXPWM_SMCAPTCTRLA_EDGCNTA_EN_WIDTH     (1U)
#define FLEXPWM_SMCAPTCTRLA_EDGCNTA_EN(x)        (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLA_EDGCNTA_EN_SHIFT)) & FLEXPWM_SMCAPTCTRLA_EDGCNTA_EN_MASK)

#define FLEXPWM_SMCAPTCTRLA_CFAWM_MASK           (0x300U)
#define FLEXPWM_SMCAPTCTRLA_CFAWM_SHIFT          (8U)
#define FLEXPWM_SMCAPTCTRLA_CFAWM_WIDTH          (2U)
#define FLEXPWM_SMCAPTCTRLA_CFAWM(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLA_CFAWM_SHIFT)) & FLEXPWM_SMCAPTCTRLA_CFAWM_MASK)

#define FLEXPWM_SMCAPTCTRLA_CA0CNT_MASK          (0x1C00U)
#define FLEXPWM_SMCAPTCTRLA_CA0CNT_SHIFT         (10U)
#define FLEXPWM_SMCAPTCTRLA_CA0CNT_WIDTH         (3U)
#define FLEXPWM_SMCAPTCTRLA_CA0CNT(x)            (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLA_CA0CNT_SHIFT)) & FLEXPWM_SMCAPTCTRLA_CA0CNT_MASK)

#define FLEXPWM_SMCAPTCTRLA_CA1CNT_MASK          (0xE000U)
#define FLEXPWM_SMCAPTCTRLA_CA1CNT_SHIFT         (13U)
#define FLEXPWM_SMCAPTCTRLA_CA1CNT_WIDTH         (3U)
#define FLEXPWM_SMCAPTCTRLA_CA1CNT(x)            (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLA_CA1CNT_SHIFT)) & FLEXPWM_SMCAPTCTRLA_CA1CNT_MASK)
/*! @} */

/*! @name SMCAPTCOMPA - Submodule Capture Compare A */
/*! @{ */

#define FLEXPWM_SMCAPTCOMPA_EDGCMPA_MASK         (0xFFU)
#define FLEXPWM_SMCAPTCOMPA_EDGCMPA_SHIFT        (0U)
#define FLEXPWM_SMCAPTCOMPA_EDGCMPA_WIDTH        (8U)
#define FLEXPWM_SMCAPTCOMPA_EDGCMPA(x)           (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCOMPA_EDGCMPA_SHIFT)) & FLEXPWM_SMCAPTCOMPA_EDGCMPA_MASK)

#define FLEXPWM_SMCAPTCOMPA_EDGCNTA_MASK         (0xFF00U)
#define FLEXPWM_SMCAPTCOMPA_EDGCNTA_SHIFT        (8U)
#define FLEXPWM_SMCAPTCOMPA_EDGCNTA_WIDTH        (8U)
#define FLEXPWM_SMCAPTCOMPA_EDGCNTA(x)           (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCOMPA_EDGCNTA_SHIFT)) & FLEXPWM_SMCAPTCOMPA_EDGCNTA_MASK)
/*! @} */

/*! @name SMCAPTCTRLB - Submodule Capture Control B */
/*! @{ */

#define FLEXPWM_SMCAPTCTRLB_ARMB_MASK            (0x1U)
#define FLEXPWM_SMCAPTCTRLB_ARMB_SHIFT           (0U)
#define FLEXPWM_SMCAPTCTRLB_ARMB_WIDTH           (1U)
#define FLEXPWM_SMCAPTCTRLB_ARMB(x)              (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLB_ARMB_SHIFT)) & FLEXPWM_SMCAPTCTRLB_ARMB_MASK)

#define FLEXPWM_SMCAPTCTRLB_ONESHOTB_MASK        (0x2U)
#define FLEXPWM_SMCAPTCTRLB_ONESHOTB_SHIFT       (1U)
#define FLEXPWM_SMCAPTCTRLB_ONESHOTB_WIDTH       (1U)
#define FLEXPWM_SMCAPTCTRLB_ONESHOTB(x)          (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLB_ONESHOTB_SHIFT)) & FLEXPWM_SMCAPTCTRLB_ONESHOTB_MASK)

#define FLEXPWM_SMCAPTCTRLB_EDGB0_MASK           (0xCU)
#define FLEXPWM_SMCAPTCTRLB_EDGB0_SHIFT          (2U)
#define FLEXPWM_SMCAPTCTRLB_EDGB0_WIDTH          (2U)
#define FLEXPWM_SMCAPTCTRLB_EDGB0(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLB_EDGB0_SHIFT)) & FLEXPWM_SMCAPTCTRLB_EDGB0_MASK)

#define FLEXPWM_SMCAPTCTRLB_EDGB1_MASK           (0x30U)
#define FLEXPWM_SMCAPTCTRLB_EDGB1_SHIFT          (4U)
#define FLEXPWM_SMCAPTCTRLB_EDGB1_WIDTH          (2U)
#define FLEXPWM_SMCAPTCTRLB_EDGB1(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLB_EDGB1_SHIFT)) & FLEXPWM_SMCAPTCTRLB_EDGB1_MASK)

#define FLEXPWM_SMCAPTCTRLB_INP_SELB_MASK        (0x40U)
#define FLEXPWM_SMCAPTCTRLB_INP_SELB_SHIFT       (6U)
#define FLEXPWM_SMCAPTCTRLB_INP_SELB_WIDTH       (1U)
#define FLEXPWM_SMCAPTCTRLB_INP_SELB(x)          (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLB_INP_SELB_SHIFT)) & FLEXPWM_SMCAPTCTRLB_INP_SELB_MASK)

#define FLEXPWM_SMCAPTCTRLB_EDGCNTB_EN_MASK      (0x80U)
#define FLEXPWM_SMCAPTCTRLB_EDGCNTB_EN_SHIFT     (7U)
#define FLEXPWM_SMCAPTCTRLB_EDGCNTB_EN_WIDTH     (1U)
#define FLEXPWM_SMCAPTCTRLB_EDGCNTB_EN(x)        (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLB_EDGCNTB_EN_SHIFT)) & FLEXPWM_SMCAPTCTRLB_EDGCNTB_EN_MASK)

