zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_FLEXPWM.h
#define FLEXPWM_SMCAPTCTRLB_CFBWM_MASK           (0x300U)
#define FLEXPWM_SMCAPTCTRLB_CFBWM_SHIFT          (8U)
#define FLEXPWM_SMCAPTCTRLB_CFBWM_WIDTH          (2U)
#define FLEXPWM_SMCAPTCTRLB_CFBWM(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLB_CFBWM_SHIFT)) & FLEXPWM_SMCAPTCTRLB_CFBWM_MASK)

#define FLEXPWM_SMCAPTCTRLB_CB0CNT_MASK          (0x1C00U)
#define FLEXPWM_SMCAPTCTRLB_CB0CNT_SHIFT         (10U)
#define FLEXPWM_SMCAPTCTRLB_CB0CNT_WIDTH         (3U)
#define FLEXPWM_SMCAPTCTRLB_CB0CNT(x)            (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLB_CB0CNT_SHIFT)) & FLEXPWM_SMCAPTCTRLB_CB0CNT_MASK)

#define FLEXPWM_SMCAPTCTRLB_CB1CNT_MASK          (0xE000U)
#define FLEXPWM_SMCAPTCTRLB_CB1CNT_SHIFT         (13U)
#define FLEXPWM_SMCAPTCTRLB_CB1CNT_WIDTH         (3U)
#define FLEXPWM_SMCAPTCTRLB_CB1CNT(x)            (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLB_CB1CNT_SHIFT)) & FLEXPWM_SMCAPTCTRLB_CB1CNT_MASK)
/*! @} */

/*! @name SMCAPTCOMPB - Submodule Capture Compare B */
/*! @{ */

#define FLEXPWM_SMCAPTCOMPB_EDGCMPB_MASK         (0xFFU)
#define FLEXPWM_SMCAPTCOMPB_EDGCMPB_SHIFT        (0U)
#define FLEXPWM_SMCAPTCOMPB_EDGCMPB_WIDTH        (8U)
#define FLEXPWM_SMCAPTCOMPB_EDGCMPB(x)           (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCOMPB_EDGCMPB_SHIFT)) & FLEXPWM_SMCAPTCOMPB_EDGCMPB_MASK)

#define FLEXPWM_SMCAPTCOMPB_EDGCNTB_MASK         (0xFF00U)
#define FLEXPWM_SMCAPTCOMPB_EDGCNTB_SHIFT        (8U)
#define FLEXPWM_SMCAPTCOMPB_EDGCNTB_WIDTH        (8U)
#define FLEXPWM_SMCAPTCOMPB_EDGCNTB(x)           (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCOMPB_EDGCNTB_SHIFT)) & FLEXPWM_SMCAPTCOMPB_EDGCNTB_MASK)
/*! @} */

/*! @name SMCAPTCTRLX - Submodule Capture Control X */
/*! @{ */

#define FLEXPWM_SMCAPTCTRLX_ARMX_MASK            (0x1U)
#define FLEXPWM_SMCAPTCTRLX_ARMX_SHIFT           (0U)
#define FLEXPWM_SMCAPTCTRLX_ARMX_WIDTH           (1U)
#define FLEXPWM_SMCAPTCTRLX_ARMX(x)              (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLX_ARMX_SHIFT)) & FLEXPWM_SMCAPTCTRLX_ARMX_MASK)

#define FLEXPWM_SMCAPTCTRLX_ONESHOTX_MASK        (0x2U)
#define FLEXPWM_SMCAPTCTRLX_ONESHOTX_SHIFT       (1U)
#define FLEXPWM_SMCAPTCTRLX_ONESHOTX_WIDTH       (1U)
#define FLEXPWM_SMCAPTCTRLX_ONESHOTX(x)          (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLX_ONESHOTX_SHIFT)) & FLEXPWM_SMCAPTCTRLX_ONESHOTX_MASK)

#define FLEXPWM_SMCAPTCTRLX_EDGX0_MASK           (0xCU)
#define FLEXPWM_SMCAPTCTRLX_EDGX0_SHIFT          (2U)
#define FLEXPWM_SMCAPTCTRLX_EDGX0_WIDTH          (2U)
#define FLEXPWM_SMCAPTCTRLX_EDGX0(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLX_EDGX0_SHIFT)) & FLEXPWM_SMCAPTCTRLX_EDGX0_MASK)

#define FLEXPWM_SMCAPTCTRLX_EDGX1_MASK           (0x30U)
#define FLEXPWM_SMCAPTCTRLX_EDGX1_SHIFT          (4U)
#define FLEXPWM_SMCAPTCTRLX_EDGX1_WIDTH          (2U)
#define FLEXPWM_SMCAPTCTRLX_EDGX1(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLX_EDGX1_SHIFT)) & FLEXPWM_SMCAPTCTRLX_EDGX1_MASK)

#define FLEXPWM_SMCAPTCTRLX_INP_SELX_MASK        (0x40U)
#define FLEXPWM_SMCAPTCTRLX_INP_SELX_SHIFT       (6U)
#define FLEXPWM_SMCAPTCTRLX_INP_SELX_WIDTH       (1U)
#define FLEXPWM_SMCAPTCTRLX_INP_SELX(x)          (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLX_INP_SELX_SHIFT)) & FLEXPWM_SMCAPTCTRLX_INP_SELX_MASK)

#define FLEXPWM_SMCAPTCTRLX_EDGCNTX_EN_MASK      (0x80U)
#define FLEXPWM_SMCAPTCTRLX_EDGCNTX_EN_SHIFT     (7U)
#define FLEXPWM_SMCAPTCTRLX_EDGCNTX_EN_WIDTH     (1U)
#define FLEXPWM_SMCAPTCTRLX_EDGCNTX_EN(x)        (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLX_EDGCNTX_EN_SHIFT)) & FLEXPWM_SMCAPTCTRLX_EDGCNTX_EN_MASK)

#define FLEXPWM_SMCAPTCTRLX_CFXWM_MASK           (0x300U)
#define FLEXPWM_SMCAPTCTRLX_CFXWM_SHIFT          (8U)
#define FLEXPWM_SMCAPTCTRLX_CFXWM_WIDTH          (2U)
#define FLEXPWM_SMCAPTCTRLX_CFXWM(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLX_CFXWM_SHIFT)) & FLEXPWM_SMCAPTCTRLX_CFXWM_MASK)

#define FLEXPWM_SMCAPTCTRLX_CX0CNT_MASK          (0x1C00U)
#define FLEXPWM_SMCAPTCTRLX_CX0CNT_SHIFT         (10U)
#define FLEXPWM_SMCAPTCTRLX_CX0CNT_WIDTH         (3U)
#define FLEXPWM_SMCAPTCTRLX_CX0CNT(x)            (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLX_CX0CNT_SHIFT)) & FLEXPWM_SMCAPTCTRLX_CX0CNT_MASK)

#define FLEXPWM_SMCAPTCTRLX_CX1CNT_MASK          (0xE000U)
#define FLEXPWM_SMCAPTCTRLX_CX1CNT_SHIFT         (13U)
#define FLEXPWM_SMCAPTCTRLX_CX1CNT_WIDTH         (3U)
#define FLEXPWM_SMCAPTCTRLX_CX1CNT(x)            (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCTRLX_CX1CNT_SHIFT)) & FLEXPWM_SMCAPTCTRLX_CX1CNT_MASK)
/*! @} */

/*! @name SMCAPTCOMPX - Submodule Capture Compare X */
/*! @{ */

#define FLEXPWM_SMCAPTCOMPX_EDGCMPX_MASK         (0xFFU)
#define FLEXPWM_SMCAPTCOMPX_EDGCMPX_SHIFT        (0U)
#define FLEXPWM_SMCAPTCOMPX_EDGCMPX_WIDTH        (8U)
#define FLEXPWM_SMCAPTCOMPX_EDGCMPX(x)           (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCOMPX_EDGCMPX_SHIFT)) & FLEXPWM_SMCAPTCOMPX_EDGCMPX_MASK)

#define FLEXPWM_SMCAPTCOMPX_EDGCNTX_MASK         (0xFF00U)
#define FLEXPWM_SMCAPTCOMPX_EDGCNTX_SHIFT        (8U)
#define FLEXPWM_SMCAPTCOMPX_EDGCNTX_WIDTH        (8U)
#define FLEXPWM_SMCAPTCOMPX_EDGCNTX(x)           (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCAPTCOMPX_EDGCNTX_SHIFT)) & FLEXPWM_SMCAPTCOMPX_EDGCNTX_MASK)
/*! @} */

/*! @name SMCVAL0 - Submodule Capture Value 0 */
/*! @{ */

#define FLEXPWM_SMCVAL0_CAPTVAL0_MASK            (0xFFFFU)
#define FLEXPWM_SMCVAL0_CAPTVAL0_SHIFT           (0U)
#define FLEXPWM_SMCVAL0_CAPTVAL0_WIDTH           (16U)
#define FLEXPWM_SMCVAL0_CAPTVAL0(x)              (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCVAL0_CAPTVAL0_SHIFT)) & FLEXPWM_SMCVAL0_CAPTVAL0_MASK)
/*! @} */

/*! @name SMCVAL0CYC - Submodule Capture Value 0 Cycle */
/*! @{ */

#define FLEXPWM_SMCVAL0CYC_CVAL0CYC_MASK         (0xFU)
#define FLEXPWM_SMCVAL0CYC_CVAL0CYC_SHIFT        (0U)
#define FLEXPWM_SMCVAL0CYC_CVAL0CYC_WIDTH        (4U)
#define FLEXPWM_SMCVAL0CYC_CVAL0CYC(x)           (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCVAL0CYC_CVAL0CYC_SHIFT)) & FLEXPWM_SMCVAL0CYC_CVAL0CYC_MASK)
/*! @} */

/*! @name SMCVAL1 - Submodule Capture Value 1 */
/*! @{ */

