zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_FLEXPWM.h
#define FLEXPWM_SMCVAL1_CAPTVAL1_MASK            (0xFFFFU)
#define FLEXPWM_SMCVAL1_CAPTVAL1_SHIFT           (0U)
#define FLEXPWM_SMCVAL1_CAPTVAL1_WIDTH           (16U)
#define FLEXPWM_SMCVAL1_CAPTVAL1(x)              (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCVAL1_CAPTVAL1_SHIFT)) & FLEXPWM_SMCVAL1_CAPTVAL1_MASK)
/*! @} */

/*! @name SMCVAL1CYC - Submodule Capture Value 1 Cycle */
/*! @{ */

#define FLEXPWM_SMCVAL1CYC_CVAL1CYC_MASK         (0xFU)
#define FLEXPWM_SMCVAL1CYC_CVAL1CYC_SHIFT        (0U)
#define FLEXPWM_SMCVAL1CYC_CVAL1CYC_WIDTH        (4U)
#define FLEXPWM_SMCVAL1CYC_CVAL1CYC(x)           (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCVAL1CYC_CVAL1CYC_SHIFT)) & FLEXPWM_SMCVAL1CYC_CVAL1CYC_MASK)
/*! @} */

/*! @name SMCVAL2 - Submodule Capture Value 2 */
/*! @{ */

#define FLEXPWM_SMCVAL2_CAPTVAL2_MASK            (0xFFFFU)
#define FLEXPWM_SMCVAL2_CAPTVAL2_SHIFT           (0U)
#define FLEXPWM_SMCVAL2_CAPTVAL2_WIDTH           (16U)
#define FLEXPWM_SMCVAL2_CAPTVAL2(x)              (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCVAL2_CAPTVAL2_SHIFT)) & FLEXPWM_SMCVAL2_CAPTVAL2_MASK)
/*! @} */

/*! @name SMCVAL2CYC - Submodule Capture Value 2 Cycle */
/*! @{ */

#define FLEXPWM_SMCVAL2CYC_CVAL2CYC_MASK         (0xFU)
#define FLEXPWM_SMCVAL2CYC_CVAL2CYC_SHIFT        (0U)
#define FLEXPWM_SMCVAL2CYC_CVAL2CYC_WIDTH        (4U)
#define FLEXPWM_SMCVAL2CYC_CVAL2CYC(x)           (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCVAL2CYC_CVAL2CYC_SHIFT)) & FLEXPWM_SMCVAL2CYC_CVAL2CYC_MASK)
/*! @} */

/*! @name SMCVAL3 - Submodule Capture Value 3 */
/*! @{ */

#define FLEXPWM_SMCVAL3_CAPTVAL3_MASK            (0xFFFFU)
#define FLEXPWM_SMCVAL3_CAPTVAL3_SHIFT           (0U)
#define FLEXPWM_SMCVAL3_CAPTVAL3_WIDTH           (16U)
#define FLEXPWM_SMCVAL3_CAPTVAL3(x)              (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCVAL3_CAPTVAL3_SHIFT)) & FLEXPWM_SMCVAL3_CAPTVAL3_MASK)
/*! @} */

/*! @name SMCVAL3CYC - Submodule Capture Value 3 Cycle */
/*! @{ */

#define FLEXPWM_SMCVAL3CYC_CVAL3CYC_MASK         (0xFU)
#define FLEXPWM_SMCVAL3CYC_CVAL3CYC_SHIFT        (0U)
#define FLEXPWM_SMCVAL3CYC_CVAL3CYC_WIDTH        (4U)
#define FLEXPWM_SMCVAL3CYC_CVAL3CYC(x)           (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCVAL3CYC_CVAL3CYC_SHIFT)) & FLEXPWM_SMCVAL3CYC_CVAL3CYC_MASK)
/*! @} */

/*! @name SMCVAL4 - Submodule Capture Value 4 */
/*! @{ */

#define FLEXPWM_SMCVAL4_CAPTVAL4_MASK            (0xFFFFU)
#define FLEXPWM_SMCVAL4_CAPTVAL4_SHIFT           (0U)
#define FLEXPWM_SMCVAL4_CAPTVAL4_WIDTH           (16U)
#define FLEXPWM_SMCVAL4_CAPTVAL4(x)              (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCVAL4_CAPTVAL4_SHIFT)) & FLEXPWM_SMCVAL4_CAPTVAL4_MASK)
/*! @} */

/*! @name SMCVAL4CYC - Submodule Capture Value 4 Cycle */
/*! @{ */

#define FLEXPWM_SMCVAL4CYC_CVAL4CYC_MASK         (0xFU)
#define FLEXPWM_SMCVAL4CYC_CVAL4CYC_SHIFT        (0U)
#define FLEXPWM_SMCVAL4CYC_CVAL4CYC_WIDTH        (4U)
#define FLEXPWM_SMCVAL4CYC_CVAL4CYC(x)           (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCVAL4CYC_CVAL4CYC_SHIFT)) & FLEXPWM_SMCVAL4CYC_CVAL4CYC_MASK)
/*! @} */

/*! @name SMCVAL5 - Submodule Capture Value 5 */
/*! @{ */

#define FLEXPWM_SMCVAL5_CAPTVAL5_MASK            (0xFFFFU)
#define FLEXPWM_SMCVAL5_CAPTVAL5_SHIFT           (0U)
#define FLEXPWM_SMCVAL5_CAPTVAL5_WIDTH           (16U)
#define FLEXPWM_SMCVAL5_CAPTVAL5(x)              (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCVAL5_CAPTVAL5_SHIFT)) & FLEXPWM_SMCVAL5_CAPTVAL5_MASK)
/*! @} */

/*! @name SMCVAL5CYC - Submodule Capture Value 5 Cycle */
/*! @{ */

#define FLEXPWM_SMCVAL5CYC_CVAL5CYC_MASK         (0xFU)
#define FLEXPWM_SMCVAL5CYC_CVAL5CYC_SHIFT        (0U)
#define FLEXPWM_SMCVAL5CYC_CVAL5CYC_WIDTH        (4U)
#define FLEXPWM_SMCVAL5CYC_CVAL5CYC(x)           (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMCVAL5CYC_CVAL5CYC_SHIFT)) & FLEXPWM_SMCVAL5CYC_CVAL5CYC_MASK)
/*! @} */

/*! @name SMPHASEDLY - Submodule Phase Delay */
/*! @{ */

#define FLEXPWM_SMPHASEDLY_PHASEDLY_MASK         (0xFFFFU)
#define FLEXPWM_SMPHASEDLY_PHASEDLY_SHIFT        (0U)
#define FLEXPWM_SMPHASEDLY_PHASEDLY_WIDTH        (16U)
#define FLEXPWM_SMPHASEDLY_PHASEDLY(x)           (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SMPHASEDLY_PHASEDLY_SHIFT)) & FLEXPWM_SMPHASEDLY_PHASEDLY_MASK)
/*! @} */

/*! @name OUTEN - Output Enable */
/*! @{ */

#define FLEXPWM_OUTEN_PWMX_EN_MASK               (0xFU)
#define FLEXPWM_OUTEN_PWMX_EN_SHIFT              (0U)
#define FLEXPWM_OUTEN_PWMX_EN_WIDTH              (4U)
#define FLEXPWM_OUTEN_PWMX_EN(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_OUTEN_PWMX_EN_SHIFT)) & FLEXPWM_OUTEN_PWMX_EN_MASK)

#define FLEXPWM_OUTEN_PWMB_EN_MASK               (0xF0U)
#define FLEXPWM_OUTEN_PWMB_EN_SHIFT              (4U)
#define FLEXPWM_OUTEN_PWMB_EN_WIDTH              (4U)
#define FLEXPWM_OUTEN_PWMB_EN(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_OUTEN_PWMB_EN_SHIFT)) & FLEXPWM_OUTEN_PWMB_EN_MASK)

#define FLEXPWM_OUTEN_PWMA_EN_MASK               (0xF00U)
#define FLEXPWM_OUTEN_PWMA_EN_SHIFT              (8U)
#define FLEXPWM_OUTEN_PWMA_EN_WIDTH              (4U)
#define FLEXPWM_OUTEN_PWMA_EN(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_OUTEN_PWMA_EN_SHIFT)) & FLEXPWM_OUTEN_PWMA_EN_MASK)
/*! @} */

/*! @name MASK - Mask */
/*! @{ */

#define FLEXPWM_MASK_MASKX_MASK                  (0xFU)
#define FLEXPWM_MASK_MASKX_SHIFT                 (0U)
#define FLEXPWM_MASK_MASKX_WIDTH                 (4U)
#define FLEXPWM_MASK_MASKX(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_MASK_MASKX_SHIFT)) & FLEXPWM_MASK_MASKX_MASK)

#define FLEXPWM_MASK_MASKB_MASK                  (0xF0U)
#define FLEXPWM_MASK_MASKB_SHIFT                 (4U)
#define FLEXPWM_MASK_MASKB_WIDTH                 (4U)
#define FLEXPWM_MASK_MASKB(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_MASK_MASKB_SHIFT)) & FLEXPWM_MASK_MASKB_MASK)

#define FLEXPWM_MASK_MASKA_MASK                  (0xF00U)
#define FLEXPWM_MASK_MASKA_SHIFT                 (8U)
#define FLEXPWM_MASK_MASKA_WIDTH                 (4U)
#define FLEXPWM_MASK_MASKA(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_MASK_MASKA_SHIFT)) & FLEXPWM_MASK_MASKA_MASK)

#define FLEXPWM_MASK_UPDATE_MASK_MASK            (0xF000U)
#define FLEXPWM_MASK_UPDATE_MASK_SHIFT           (12U)
#define FLEXPWM_MASK_UPDATE_MASK_WIDTH           (4U)
#define FLEXPWM_MASK_UPDATE_MASK(x)              (((uint16_t)(((uint16_t)(x)) << FLEXPWM_MASK_UPDATE_MASK_SHIFT)) & FLEXPWM_MASK_UPDATE_MASK_MASK)
/*! @} */

