zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_FLEXPWM.h
/*! @name SWCOUT - Software Controlled Output */
/*! @{ */

#define FLEXPWM_SWCOUT_SM0OUT45_MASK             (0x1U)
#define FLEXPWM_SWCOUT_SM0OUT45_SHIFT            (0U)
#define FLEXPWM_SWCOUT_SM0OUT45_WIDTH            (1U)
#define FLEXPWM_SWCOUT_SM0OUT45(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SWCOUT_SM0OUT45_SHIFT)) & FLEXPWM_SWCOUT_SM0OUT45_MASK)

#define FLEXPWM_SWCOUT_SM0OUT23_MASK             (0x2U)
#define FLEXPWM_SWCOUT_SM0OUT23_SHIFT            (1U)
#define FLEXPWM_SWCOUT_SM0OUT23_WIDTH            (1U)
#define FLEXPWM_SWCOUT_SM0OUT23(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SWCOUT_SM0OUT23_SHIFT)) & FLEXPWM_SWCOUT_SM0OUT23_MASK)

#define FLEXPWM_SWCOUT_SM1OUT45_MASK             (0x4U)
#define FLEXPWM_SWCOUT_SM1OUT45_SHIFT            (2U)
#define FLEXPWM_SWCOUT_SM1OUT45_WIDTH            (1U)
#define FLEXPWM_SWCOUT_SM1OUT45(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SWCOUT_SM1OUT45_SHIFT)) & FLEXPWM_SWCOUT_SM1OUT45_MASK)

#define FLEXPWM_SWCOUT_SM1OUT23_MASK             (0x8U)
#define FLEXPWM_SWCOUT_SM1OUT23_SHIFT            (3U)
#define FLEXPWM_SWCOUT_SM1OUT23_WIDTH            (1U)
#define FLEXPWM_SWCOUT_SM1OUT23(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SWCOUT_SM1OUT23_SHIFT)) & FLEXPWM_SWCOUT_SM1OUT23_MASK)

#define FLEXPWM_SWCOUT_SM2OUT45_MASK             (0x10U)
#define FLEXPWM_SWCOUT_SM2OUT45_SHIFT            (4U)
#define FLEXPWM_SWCOUT_SM2OUT45_WIDTH            (1U)
#define FLEXPWM_SWCOUT_SM2OUT45(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SWCOUT_SM2OUT45_SHIFT)) & FLEXPWM_SWCOUT_SM2OUT45_MASK)

#define FLEXPWM_SWCOUT_SM2OUT23_MASK             (0x20U)
#define FLEXPWM_SWCOUT_SM2OUT23_SHIFT            (5U)
#define FLEXPWM_SWCOUT_SM2OUT23_WIDTH            (1U)
#define FLEXPWM_SWCOUT_SM2OUT23(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SWCOUT_SM2OUT23_SHIFT)) & FLEXPWM_SWCOUT_SM2OUT23_MASK)

#define FLEXPWM_SWCOUT_SM3OUT45_MASK             (0x40U)
#define FLEXPWM_SWCOUT_SM3OUT45_SHIFT            (6U)
#define FLEXPWM_SWCOUT_SM3OUT45_WIDTH            (1U)
#define FLEXPWM_SWCOUT_SM3OUT45(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SWCOUT_SM3OUT45_SHIFT)) & FLEXPWM_SWCOUT_SM3OUT45_MASK)

#define FLEXPWM_SWCOUT_SM3OUT23_MASK             (0x80U)
#define FLEXPWM_SWCOUT_SM3OUT23_SHIFT            (7U)
#define FLEXPWM_SWCOUT_SM3OUT23_WIDTH            (1U)
#define FLEXPWM_SWCOUT_SM3OUT23(x)               (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SWCOUT_SM3OUT23_SHIFT)) & FLEXPWM_SWCOUT_SM3OUT23_MASK)
/*! @} */

/*! @name DTSRCSEL - PWM Source Select */
/*! @{ */

#define FLEXPWM_DTSRCSEL_SM0SEL45_MASK           (0x3U)
#define FLEXPWM_DTSRCSEL_SM0SEL45_SHIFT          (0U)
#define FLEXPWM_DTSRCSEL_SM0SEL45_WIDTH          (2U)
#define FLEXPWM_DTSRCSEL_SM0SEL45(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DTSRCSEL_SM0SEL45_SHIFT)) & FLEXPWM_DTSRCSEL_SM0SEL45_MASK)

#define FLEXPWM_DTSRCSEL_SM0SEL23_MASK           (0xCU)
#define FLEXPWM_DTSRCSEL_SM0SEL23_SHIFT          (2U)
#define FLEXPWM_DTSRCSEL_SM0SEL23_WIDTH          (2U)
#define FLEXPWM_DTSRCSEL_SM0SEL23(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DTSRCSEL_SM0SEL23_SHIFT)) & FLEXPWM_DTSRCSEL_SM0SEL23_MASK)

#define FLEXPWM_DTSRCSEL_SM1SEL45_MASK           (0x30U)
#define FLEXPWM_DTSRCSEL_SM1SEL45_SHIFT          (4U)
#define FLEXPWM_DTSRCSEL_SM1SEL45_WIDTH          (2U)
#define FLEXPWM_DTSRCSEL_SM1SEL45(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DTSRCSEL_SM1SEL45_SHIFT)) & FLEXPWM_DTSRCSEL_SM1SEL45_MASK)

#define FLEXPWM_DTSRCSEL_SM1SEL23_MASK           (0xC0U)
#define FLEXPWM_DTSRCSEL_SM1SEL23_SHIFT          (6U)
#define FLEXPWM_DTSRCSEL_SM1SEL23_WIDTH          (2U)
#define FLEXPWM_DTSRCSEL_SM1SEL23(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DTSRCSEL_SM1SEL23_SHIFT)) & FLEXPWM_DTSRCSEL_SM1SEL23_MASK)

#define FLEXPWM_DTSRCSEL_SM2SEL45_MASK           (0x300U)
#define FLEXPWM_DTSRCSEL_SM2SEL45_SHIFT          (8U)
#define FLEXPWM_DTSRCSEL_SM2SEL45_WIDTH          (2U)
#define FLEXPWM_DTSRCSEL_SM2SEL45(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DTSRCSEL_SM2SEL45_SHIFT)) & FLEXPWM_DTSRCSEL_SM2SEL45_MASK)

#define FLEXPWM_DTSRCSEL_SM2SEL23_MASK           (0xC00U)
#define FLEXPWM_DTSRCSEL_SM2SEL23_SHIFT          (10U)
#define FLEXPWM_DTSRCSEL_SM2SEL23_WIDTH          (2U)
#define FLEXPWM_DTSRCSEL_SM2SEL23(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DTSRCSEL_SM2SEL23_SHIFT)) & FLEXPWM_DTSRCSEL_SM2SEL23_MASK)

#define FLEXPWM_DTSRCSEL_SM3SEL45_MASK           (0x3000U)
#define FLEXPWM_DTSRCSEL_SM3SEL45_SHIFT          (12U)
#define FLEXPWM_DTSRCSEL_SM3SEL45_WIDTH          (2U)
#define FLEXPWM_DTSRCSEL_SM3SEL45(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DTSRCSEL_SM3SEL45_SHIFT)) & FLEXPWM_DTSRCSEL_SM3SEL45_MASK)

#define FLEXPWM_DTSRCSEL_SM3SEL23_MASK           (0xC000U)
#define FLEXPWM_DTSRCSEL_SM3SEL23_SHIFT          (14U)
#define FLEXPWM_DTSRCSEL_SM3SEL23_WIDTH          (2U)
#define FLEXPWM_DTSRCSEL_SM3SEL23(x)             (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DTSRCSEL_SM3SEL23_SHIFT)) & FLEXPWM_DTSRCSEL_SM3SEL23_MASK)
/*! @} */

/*! @name MCTRL - Master Control */
/*! @{ */

#define FLEXPWM_MCTRL_LDOK_MASK                  (0xFU)
#define FLEXPWM_MCTRL_LDOK_SHIFT                 (0U)
#define FLEXPWM_MCTRL_LDOK_WIDTH                 (4U)
#define FLEXPWM_MCTRL_LDOK(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_MCTRL_LDOK_SHIFT)) & FLEXPWM_MCTRL_LDOK_MASK)

#define FLEXPWM_MCTRL_CLDOK_MASK                 (0xF0U)
#define FLEXPWM_MCTRL_CLDOK_SHIFT                (4U)
#define FLEXPWM_MCTRL_CLDOK_WIDTH                (4U)
#define FLEXPWM_MCTRL_CLDOK(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_MCTRL_CLDOK_SHIFT)) & FLEXPWM_MCTRL_CLDOK_MASK)

#define FLEXPWM_MCTRL_RUN_MASK                   (0xF00U)
#define FLEXPWM_MCTRL_RUN_SHIFT                  (8U)
#define FLEXPWM_MCTRL_RUN_WIDTH                  (4U)
#define FLEXPWM_MCTRL_RUN(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_MCTRL_RUN_SHIFT)) & FLEXPWM_MCTRL_RUN_MASK)

#define FLEXPWM_MCTRL_IPOL_MASK                  (0xF000U)
#define FLEXPWM_MCTRL_IPOL_SHIFT                 (12U)
#define FLEXPWM_MCTRL_IPOL_WIDTH                 (4U)
#define FLEXPWM_MCTRL_IPOL(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_MCTRL_IPOL_SHIFT)) & FLEXPWM_MCTRL_IPOL_MASK)
/*! @} */

