zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_FLEXPWM.h
/*! @name MCTRL2 - Master Control 2 */
/*! @{ */

#define FLEXPWM_MCTRL2_MONPLL_MASK               (0x3U)
#define FLEXPWM_MCTRL2_MONPLL_SHIFT              (0U)
#define FLEXPWM_MCTRL2_MONPLL_WIDTH              (2U)
#define FLEXPWM_MCTRL2_MONPLL(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_MCTRL2_MONPLL_SHIFT)) & FLEXPWM_MCTRL2_MONPLL_MASK)
/*! @} */

/*! @name FCTRL - Fault Control */
/*! @{ */

#define FLEXPWM_FCTRL_FIE_MASK                   (0xFU)
#define FLEXPWM_FCTRL_FIE_SHIFT                  (0U)
#define FLEXPWM_FCTRL_FIE_WIDTH                  (4U)
#define FLEXPWM_FCTRL_FIE(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_FCTRL_FIE_SHIFT)) & FLEXPWM_FCTRL_FIE_MASK)

#define FLEXPWM_FCTRL_FSAFE_MASK                 (0xF0U)
#define FLEXPWM_FCTRL_FSAFE_SHIFT                (4U)
#define FLEXPWM_FCTRL_FSAFE_WIDTH                (4U)
#define FLEXPWM_FCTRL_FSAFE(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_FCTRL_FSAFE_SHIFT)) & FLEXPWM_FCTRL_FSAFE_MASK)

#define FLEXPWM_FCTRL_FAUTO_MASK                 (0xF00U)
#define FLEXPWM_FCTRL_FAUTO_SHIFT                (8U)
#define FLEXPWM_FCTRL_FAUTO_WIDTH                (4U)
#define FLEXPWM_FCTRL_FAUTO(x)                   (((uint16_t)(((uint16_t)(x)) << FLEXPWM_FCTRL_FAUTO_SHIFT)) & FLEXPWM_FCTRL_FAUTO_MASK)

#define FLEXPWM_FCTRL_FLVL_MASK                  (0xF000U)
#define FLEXPWM_FCTRL_FLVL_SHIFT                 (12U)
#define FLEXPWM_FCTRL_FLVL_WIDTH                 (4U)
#define FLEXPWM_FCTRL_FLVL(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_FCTRL_FLVL_SHIFT)) & FLEXPWM_FCTRL_FLVL_MASK)
/*! @} */

/*! @name FSTS - Fault Status */
/*! @{ */

#define FLEXPWM_FSTS_FFLAG_MASK                  (0xFU)
#define FLEXPWM_FSTS_FFLAG_SHIFT                 (0U)
#define FLEXPWM_FSTS_FFLAG_WIDTH                 (4U)
#define FLEXPWM_FSTS_FFLAG(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_FSTS_FFLAG_SHIFT)) & FLEXPWM_FSTS_FFLAG_MASK)

#define FLEXPWM_FSTS_FFULL_MASK                  (0xF0U)
#define FLEXPWM_FSTS_FFULL_SHIFT                 (4U)
#define FLEXPWM_FSTS_FFULL_WIDTH                 (4U)
#define FLEXPWM_FSTS_FFULL(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_FSTS_FFULL_SHIFT)) & FLEXPWM_FSTS_FFULL_MASK)

#define FLEXPWM_FSTS_FFPIN_MASK                  (0xF00U)
#define FLEXPWM_FSTS_FFPIN_SHIFT                 (8U)
#define FLEXPWM_FSTS_FFPIN_WIDTH                 (4U)
#define FLEXPWM_FSTS_FFPIN(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_FSTS_FFPIN_SHIFT)) & FLEXPWM_FSTS_FFPIN_MASK)

#define FLEXPWM_FSTS_FHALF_MASK                  (0xF000U)
#define FLEXPWM_FSTS_FHALF_SHIFT                 (12U)
#define FLEXPWM_FSTS_FHALF_WIDTH                 (4U)
#define FLEXPWM_FSTS_FHALF(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_FSTS_FHALF_SHIFT)) & FLEXPWM_FSTS_FHALF_MASK)
/*! @} */

/*! @name FFILT - Fault Filter */
/*! @{ */

#define FLEXPWM_FFILT_FILT_PER_MASK              (0xFFU)
#define FLEXPWM_FFILT_FILT_PER_SHIFT             (0U)
#define FLEXPWM_FFILT_FILT_PER_WIDTH             (8U)
#define FLEXPWM_FFILT_FILT_PER(x)                (((uint16_t)(((uint16_t)(x)) << FLEXPWM_FFILT_FILT_PER_SHIFT)) & FLEXPWM_FFILT_FILT_PER_MASK)

#define FLEXPWM_FFILT_FILT_CNT_MASK              (0x700U)
#define FLEXPWM_FFILT_FILT_CNT_SHIFT             (8U)
#define FLEXPWM_FFILT_FILT_CNT_WIDTH             (3U)
#define FLEXPWM_FFILT_FILT_CNT(x)                (((uint16_t)(((uint16_t)(x)) << FLEXPWM_FFILT_FILT_CNT_SHIFT)) & FLEXPWM_FFILT_FILT_CNT_MASK)

#define FLEXPWM_FFILT_GSTR_MASK                  (0x8000U)
#define FLEXPWM_FFILT_GSTR_SHIFT                 (15U)
#define FLEXPWM_FFILT_GSTR_WIDTH                 (1U)
#define FLEXPWM_FFILT_GSTR(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_FFILT_GSTR_SHIFT)) & FLEXPWM_FFILT_GSTR_MASK)
/*! @} */

/*! @name FTST - Fault Test */
/*! @{ */

#define FLEXPWM_FTST_FTEST_MASK                  (0x1U)
#define FLEXPWM_FTST_FTEST_SHIFT                 (0U)
#define FLEXPWM_FTST_FTEST_WIDTH                 (1U)
#define FLEXPWM_FTST_FTEST(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_FTST_FTEST_SHIFT)) & FLEXPWM_FTST_FTEST_MASK)
/*! @} */

/*! @name FCTRL2 - Fault Control 2 */
/*! @{ */

#define FLEXPWM_FCTRL2_NOCOMB_MASK               (0xFU)
#define FLEXPWM_FCTRL2_NOCOMB_SHIFT              (0U)
#define FLEXPWM_FCTRL2_NOCOMB_WIDTH              (4U)
#define FLEXPWM_FCTRL2_NOCOMB(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_FCTRL2_NOCOMB_SHIFT)) & FLEXPWM_FCTRL2_NOCOMB_MASK)
/*! @} */

/*! @name DLLCTRL - DLL Control */
/*! @{ */

#define FLEXPWM_DLLCTRL_DLLEN_MASK               (0x1U)
#define FLEXPWM_DLLCTRL_DLLEN_SHIFT              (0U)
#define FLEXPWM_DLLCTRL_DLLEN_WIDTH              (1U)
#define FLEXPWM_DLLCTRL_DLLEN(x)                 (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DLLCTRL_DLLEN_SHIFT)) & FLEXPWM_DLLCTRL_DLLEN_MASK)
/*! @} */

/*! @name DLLSR - DLL Status */
/*! @{ */

#define FLEXPWM_DLLSR_LOCK_MASK                  (0x1U)
#define FLEXPWM_DLLSR_LOCK_SHIFT                 (0U)
#define FLEXPWM_DLLSR_LOCK_WIDTH                 (1U)
#define FLEXPWM_DLLSR_LOCK(x)                    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DLLSR_LOCK_SHIFT)) & FLEXPWM_DLLSR_LOCK_MASK)

#define FLEXPWM_DLLSR_LOL_MASK                   (0x2U)
#define FLEXPWM_DLLSR_LOL_SHIFT                  (1U)
#define FLEXPWM_DLLSR_LOL_WIDTH                  (1U)
#define FLEXPWM_DLLSR_LOL(x)                     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_DLLSR_LOL_SHIFT)) & FLEXPWM_DLLSR_LOL_MASK)
/*! @} */

/*! @name SM0BIST_CTRL - Submodule BIST Control */
/*! @{ */

#define FLEXPWM_SM0BIST_CTRL_BIST_ENABLE_MASK    (0x1U)
#define FLEXPWM_SM0BIST_CTRL_BIST_ENABLE_SHIFT   (0U)
#define FLEXPWM_SM0BIST_CTRL_BIST_ENABLE_WIDTH   (1U)
#define FLEXPWM_SM0BIST_CTRL_BIST_ENABLE(x)      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM0BIST_CTRL_BIST_ENABLE_SHIFT)) & FLEXPWM_SM0BIST_CTRL_BIST_ENABLE_MASK)

#define FLEXPWM_SM0BIST_CTRL_CLK_INITIAL_MASK    (0x3EU)
#define FLEXPWM_SM0BIST_CTRL_CLK_INITIAL_SHIFT   (1U)
#define FLEXPWM_SM0BIST_CTRL_CLK_INITIAL_WIDTH   (5U)
#define FLEXPWM_SM0BIST_CTRL_CLK_INITIAL(x)      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM0BIST_CTRL_CLK_INITIAL_SHIFT)) & FLEXPWM_SM0BIST_CTRL_CLK_INITIAL_MASK)

#define FLEXPWM_SM0BIST_CTRL_TOGGLE_MODE_MASK    (0x40U)
#define FLEXPWM_SM0BIST_CTRL_TOGGLE_MODE_SHIFT   (6U)
#define FLEXPWM_SM0BIST_CTRL_TOGGLE_MODE_WIDTH   (1U)
#define FLEXPWM_SM0BIST_CTRL_TOGGLE_MODE(x)      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM0BIST_CTRL_TOGGLE_MODE_SHIFT)) & FLEXPWM_SM0BIST_CTRL_TOGGLE_MODE_MASK)

#define FLEXPWM_SM0BIST_CTRL_MANUAL_TOGGLE_MASK  (0x80U)
#define FLEXPWM_SM0BIST_CTRL_MANUAL_TOGGLE_SHIFT (7U)
#define FLEXPWM_SM0BIST_CTRL_MANUAL_TOGGLE_WIDTH (1U)
#define FLEXPWM_SM0BIST_CTRL_MANUAL_TOGGLE(x)    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM0BIST_CTRL_MANUAL_TOGGLE_SHIFT)) & FLEXPWM_SM0BIST_CTRL_MANUAL_TOGGLE_MASK)

