zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_FLEXPWM.h
#define FLEXPWM_SM0BIST_CTRL_CLK_FINAL_MASK      (0x1F00U)
#define FLEXPWM_SM0BIST_CTRL_CLK_FINAL_SHIFT     (8U)
#define FLEXPWM_SM0BIST_CTRL_CLK_FINAL_WIDTH     (5U)
#define FLEXPWM_SM0BIST_CTRL_CLK_FINAL(x)        (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM0BIST_CTRL_CLK_FINAL_SHIFT)) & FLEXPWM_SM0BIST_CTRL_CLK_FINAL_MASK)

#define FLEXPWM_SM0BIST_CTRL_COUNTER_THRESHOLD_MASK (0xE000U)
#define FLEXPWM_SM0BIST_CTRL_COUNTER_THRESHOLD_SHIFT (13U)
#define FLEXPWM_SM0BIST_CTRL_COUNTER_THRESHOLD_WIDTH (3U)
#define FLEXPWM_SM0BIST_CTRL_COUNTER_THRESHOLD(x) (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM0BIST_CTRL_COUNTER_THRESHOLD_SHIFT)) & FLEXPWM_SM0BIST_CTRL_COUNTER_THRESHOLD_MASK)
/*! @} */

/*! @name SM0BIST_CTRL1 - Submodule BIST Control */
/*! @{ */

#define FLEXPWM_SM0BIST_CTRL1_DATA_INITIAL_MASK  (0x1FU)
#define FLEXPWM_SM0BIST_CTRL1_DATA_INITIAL_SHIFT (0U)
#define FLEXPWM_SM0BIST_CTRL1_DATA_INITIAL_WIDTH (5U)
#define FLEXPWM_SM0BIST_CTRL1_DATA_INITIAL(x)    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM0BIST_CTRL1_DATA_INITIAL_SHIFT)) & FLEXPWM_SM0BIST_CTRL1_DATA_INITIAL_MASK)

#define FLEXPWM_SM0BIST_CTRL1_DATA_FINAL_MASK    (0x1F00U)
#define FLEXPWM_SM0BIST_CTRL1_DATA_FINAL_SHIFT   (8U)
#define FLEXPWM_SM0BIST_CTRL1_DATA_FINAL_WIDTH   (5U)
#define FLEXPWM_SM0BIST_CTRL1_DATA_FINAL(x)      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM0BIST_CTRL1_DATA_FINAL_SHIFT)) & FLEXPWM_SM0BIST_CTRL1_DATA_FINAL_MASK)
/*! @} */

/*! @name SM1BIST_CTRL - Submodule BIST Control */
/*! @{ */

#define FLEXPWM_SM1BIST_CTRL_BIST_ENABLE_MASK    (0x1U)
#define FLEXPWM_SM1BIST_CTRL_BIST_ENABLE_SHIFT   (0U)
#define FLEXPWM_SM1BIST_CTRL_BIST_ENABLE_WIDTH   (1U)
#define FLEXPWM_SM1BIST_CTRL_BIST_ENABLE(x)      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM1BIST_CTRL_BIST_ENABLE_SHIFT)) & FLEXPWM_SM1BIST_CTRL_BIST_ENABLE_MASK)

#define FLEXPWM_SM1BIST_CTRL_CLK_INITIAL_MASK    (0x3EU)
#define FLEXPWM_SM1BIST_CTRL_CLK_INITIAL_SHIFT   (1U)
#define FLEXPWM_SM1BIST_CTRL_CLK_INITIAL_WIDTH   (5U)
#define FLEXPWM_SM1BIST_CTRL_CLK_INITIAL(x)      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM1BIST_CTRL_CLK_INITIAL_SHIFT)) & FLEXPWM_SM1BIST_CTRL_CLK_INITIAL_MASK)

#define FLEXPWM_SM1BIST_CTRL_TOGGLE_MODE_MASK    (0x40U)
#define FLEXPWM_SM1BIST_CTRL_TOGGLE_MODE_SHIFT   (6U)
#define FLEXPWM_SM1BIST_CTRL_TOGGLE_MODE_WIDTH   (1U)
#define FLEXPWM_SM1BIST_CTRL_TOGGLE_MODE(x)      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM1BIST_CTRL_TOGGLE_MODE_SHIFT)) & FLEXPWM_SM1BIST_CTRL_TOGGLE_MODE_MASK)

#define FLEXPWM_SM1BIST_CTRL_MANUAL_TOGGLE_MASK  (0x80U)
#define FLEXPWM_SM1BIST_CTRL_MANUAL_TOGGLE_SHIFT (7U)
#define FLEXPWM_SM1BIST_CTRL_MANUAL_TOGGLE_WIDTH (1U)
#define FLEXPWM_SM1BIST_CTRL_MANUAL_TOGGLE(x)    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM1BIST_CTRL_MANUAL_TOGGLE_SHIFT)) & FLEXPWM_SM1BIST_CTRL_MANUAL_TOGGLE_MASK)

#define FLEXPWM_SM1BIST_CTRL_CLK_FINAL_MASK      (0x1F00U)
#define FLEXPWM_SM1BIST_CTRL_CLK_FINAL_SHIFT     (8U)
#define FLEXPWM_SM1BIST_CTRL_CLK_FINAL_WIDTH     (5U)
#define FLEXPWM_SM1BIST_CTRL_CLK_FINAL(x)        (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM1BIST_CTRL_CLK_FINAL_SHIFT)) & FLEXPWM_SM1BIST_CTRL_CLK_FINAL_MASK)

#define FLEXPWM_SM1BIST_CTRL_COUNTER_THRESHOLD_MASK (0xE000U)
#define FLEXPWM_SM1BIST_CTRL_COUNTER_THRESHOLD_SHIFT (13U)
#define FLEXPWM_SM1BIST_CTRL_COUNTER_THRESHOLD_WIDTH (3U)
#define FLEXPWM_SM1BIST_CTRL_COUNTER_THRESHOLD(x) (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM1BIST_CTRL_COUNTER_THRESHOLD_SHIFT)) & FLEXPWM_SM1BIST_CTRL_COUNTER_THRESHOLD_MASK)
/*! @} */

/*! @name SM1BIST_CTRL1 - Submodule BIST Control */
/*! @{ */

#define FLEXPWM_SM1BIST_CTRL1_DATA_INITIAL_MASK  (0x1FU)
#define FLEXPWM_SM1BIST_CTRL1_DATA_INITIAL_SHIFT (0U)
#define FLEXPWM_SM1BIST_CTRL1_DATA_INITIAL_WIDTH (5U)
#define FLEXPWM_SM1BIST_CTRL1_DATA_INITIAL(x)    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM1BIST_CTRL1_DATA_INITIAL_SHIFT)) & FLEXPWM_SM1BIST_CTRL1_DATA_INITIAL_MASK)

#define FLEXPWM_SM1BIST_CTRL1_DATA_FINAL_MASK    (0x1F00U)
#define FLEXPWM_SM1BIST_CTRL1_DATA_FINAL_SHIFT   (8U)
#define FLEXPWM_SM1BIST_CTRL1_DATA_FINAL_WIDTH   (5U)
#define FLEXPWM_SM1BIST_CTRL1_DATA_FINAL(x)      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM1BIST_CTRL1_DATA_FINAL_SHIFT)) & FLEXPWM_SM1BIST_CTRL1_DATA_FINAL_MASK)
/*! @} */

/*! @name SM2BIST_CTRL - Submodule BIST Control */
/*! @{ */

#define FLEXPWM_SM2BIST_CTRL_BIST_ENABLE_MASK    (0x1U)
#define FLEXPWM_SM2BIST_CTRL_BIST_ENABLE_SHIFT   (0U)
#define FLEXPWM_SM2BIST_CTRL_BIST_ENABLE_WIDTH   (1U)
#define FLEXPWM_SM2BIST_CTRL_BIST_ENABLE(x)      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM2BIST_CTRL_BIST_ENABLE_SHIFT)) & FLEXPWM_SM2BIST_CTRL_BIST_ENABLE_MASK)

#define FLEXPWM_SM2BIST_CTRL_CLK_INITIAL_MASK    (0x3EU)
#define FLEXPWM_SM2BIST_CTRL_CLK_INITIAL_SHIFT   (1U)
#define FLEXPWM_SM2BIST_CTRL_CLK_INITIAL_WIDTH   (5U)
#define FLEXPWM_SM2BIST_CTRL_CLK_INITIAL(x)      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM2BIST_CTRL_CLK_INITIAL_SHIFT)) & FLEXPWM_SM2BIST_CTRL_CLK_INITIAL_MASK)

#define FLEXPWM_SM2BIST_CTRL_TOGGLE_MODE_MASK    (0x40U)
#define FLEXPWM_SM2BIST_CTRL_TOGGLE_MODE_SHIFT   (6U)
#define FLEXPWM_SM2BIST_CTRL_TOGGLE_MODE_WIDTH   (1U)
#define FLEXPWM_SM2BIST_CTRL_TOGGLE_MODE(x)      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM2BIST_CTRL_TOGGLE_MODE_SHIFT)) & FLEXPWM_SM2BIST_CTRL_TOGGLE_MODE_MASK)

#define FLEXPWM_SM2BIST_CTRL_MANUAL_TOGGLE_MASK  (0x80U)
#define FLEXPWM_SM2BIST_CTRL_MANUAL_TOGGLE_SHIFT (7U)
#define FLEXPWM_SM2BIST_CTRL_MANUAL_TOGGLE_WIDTH (1U)
#define FLEXPWM_SM2BIST_CTRL_MANUAL_TOGGLE(x)    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM2BIST_CTRL_MANUAL_TOGGLE_SHIFT)) & FLEXPWM_SM2BIST_CTRL_MANUAL_TOGGLE_MASK)

#define FLEXPWM_SM2BIST_CTRL_CLK_FINAL_MASK      (0x1F00U)
#define FLEXPWM_SM2BIST_CTRL_CLK_FINAL_SHIFT     (8U)
#define FLEXPWM_SM2BIST_CTRL_CLK_FINAL_WIDTH     (5U)
#define FLEXPWM_SM2BIST_CTRL_CLK_FINAL(x)        (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM2BIST_CTRL_CLK_FINAL_SHIFT)) & FLEXPWM_SM2BIST_CTRL_CLK_FINAL_MASK)

#define FLEXPWM_SM2BIST_CTRL_COUNTER_THRESHOLD_MASK (0xE000U)
#define FLEXPWM_SM2BIST_CTRL_COUNTER_THRESHOLD_SHIFT (13U)
#define FLEXPWM_SM2BIST_CTRL_COUNTER_THRESHOLD_WIDTH (3U)
#define FLEXPWM_SM2BIST_CTRL_COUNTER_THRESHOLD(x) (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM2BIST_CTRL_COUNTER_THRESHOLD_SHIFT)) & FLEXPWM_SM2BIST_CTRL_COUNTER_THRESHOLD_MASK)
/*! @} */

/*! @name SM2BIST_CTRL1 - Submodule BIST Control */
/*! @{ */

#define FLEXPWM_SM2BIST_CTRL1_DATA_INITIAL_MASK  (0x1FU)
#define FLEXPWM_SM2BIST_CTRL1_DATA_INITIAL_SHIFT (0U)
#define FLEXPWM_SM2BIST_CTRL1_DATA_INITIAL_WIDTH (5U)
#define FLEXPWM_SM2BIST_CTRL1_DATA_INITIAL(x)    (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM2BIST_CTRL1_DATA_INITIAL_SHIFT)) & FLEXPWM_SM2BIST_CTRL1_DATA_INITIAL_MASK)

#define FLEXPWM_SM2BIST_CTRL1_DATA_FINAL_MASK    (0x1F00U)
#define FLEXPWM_SM2BIST_CTRL1_DATA_FINAL_SHIFT   (8U)
#define FLEXPWM_SM2BIST_CTRL1_DATA_FINAL_WIDTH   (5U)
#define FLEXPWM_SM2BIST_CTRL1_DATA_FINAL(x)      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM2BIST_CTRL1_DATA_FINAL_SHIFT)) & FLEXPWM_SM2BIST_CTRL1_DATA_FINAL_MASK)
/*! @} */

/*! @name SM3BIST_CTRL - Submodule BIST Control */
/*! @{ */

