zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_FLEXPWM.h
#define FLEXPWM_SM2BIST_STATUS_BIST_PASS_MASK    (0x2U)
#define FLEXPWM_SM2BIST_STATUS_BIST_PASS_SHIFT   (1U)
#define FLEXPWM_SM2BIST_STATUS_BIST_PASS_WIDTH   (1U)
#define FLEXPWM_SM2BIST_STATUS_BIST_PASS(x)      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM2BIST_STATUS_BIST_PASS_SHIFT)) & FLEXPWM_SM2BIST_STATUS_BIST_PASS_MASK)

#define FLEXPWM_SM2BIST_STATUS_FAIL_CLK_MASK     (0x1F00U)
#define FLEXPWM_SM2BIST_STATUS_FAIL_CLK_SHIFT    (8U)
#define FLEXPWM_SM2BIST_STATUS_FAIL_CLK_WIDTH    (5U)
#define FLEXPWM_SM2BIST_STATUS_FAIL_CLK(x)       (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM2BIST_STATUS_FAIL_CLK_SHIFT)) & FLEXPWM_SM2BIST_STATUS_FAIL_CLK_MASK)
/*! @} */

/*! @name SM2BIST_STATUS1 - Submodule BIST Status */
/*! @{ */

#define FLEXPWM_SM2BIST_STATUS1_FAIL_DATA_MASK   (0x1FU)
#define FLEXPWM_SM2BIST_STATUS1_FAIL_DATA_SHIFT  (0U)
#define FLEXPWM_SM2BIST_STATUS1_FAIL_DATA_WIDTH  (5U)
#define FLEXPWM_SM2BIST_STATUS1_FAIL_DATA(x)     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM2BIST_STATUS1_FAIL_DATA_SHIFT)) & FLEXPWM_SM2BIST_STATUS1_FAIL_DATA_MASK)
/*! @} */

/*! @name SM3BIST_STATUS - Submodule BIST Status */
/*! @{ */

#define FLEXPWM_SM3BIST_STATUS_BIST_DONE_MASK    (0x1U)
#define FLEXPWM_SM3BIST_STATUS_BIST_DONE_SHIFT   (0U)
#define FLEXPWM_SM3BIST_STATUS_BIST_DONE_WIDTH   (1U)
#define FLEXPWM_SM3BIST_STATUS_BIST_DONE(x)      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM3BIST_STATUS_BIST_DONE_SHIFT)) & FLEXPWM_SM3BIST_STATUS_BIST_DONE_MASK)

#define FLEXPWM_SM3BIST_STATUS_BIST_PASS_MASK    (0x2U)
#define FLEXPWM_SM3BIST_STATUS_BIST_PASS_SHIFT   (1U)
#define FLEXPWM_SM3BIST_STATUS_BIST_PASS_WIDTH   (1U)
#define FLEXPWM_SM3BIST_STATUS_BIST_PASS(x)      (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM3BIST_STATUS_BIST_PASS_SHIFT)) & FLEXPWM_SM3BIST_STATUS_BIST_PASS_MASK)

#define FLEXPWM_SM3BIST_STATUS_FAIL_CLK_MASK     (0x1F00U)
#define FLEXPWM_SM3BIST_STATUS_FAIL_CLK_SHIFT    (8U)
#define FLEXPWM_SM3BIST_STATUS_FAIL_CLK_WIDTH    (5U)
#define FLEXPWM_SM3BIST_STATUS_FAIL_CLK(x)       (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM3BIST_STATUS_FAIL_CLK_SHIFT)) & FLEXPWM_SM3BIST_STATUS_FAIL_CLK_MASK)
/*! @} */

/*! @name SM3BIST_STATUS1 - Submodule BIST Status */
/*! @{ */

#define FLEXPWM_SM3BIST_STATUS1_FAIL_DATA_MASK   (0x1FU)
#define FLEXPWM_SM3BIST_STATUS1_FAIL_DATA_SHIFT  (0U)
#define FLEXPWM_SM3BIST_STATUS1_FAIL_DATA_WIDTH  (5U)
#define FLEXPWM_SM3BIST_STATUS1_FAIL_DATA(x)     (((uint16_t)(((uint16_t)(x)) << FLEXPWM_SM3BIST_STATUS1_FAIL_DATA_SHIFT)) & FLEXPWM_SM3BIST_STATUS1_FAIL_DATA_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group FLEXPWM_Register_Masks */

/*!
 * @}
 */ /* end of group FLEXPWM_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K39_FLEXPWM_H_) */
